[
    {
        "source_url": "https://www.espn.com/espn/rss/news",
        "category_group": "Sports",
        "title": "NBA trade buzz: Live updates and intel during deadline week",
        "link": "https://www.espn.com/nba/story/_/id/47191162/nba-buzz-latest-live-updates-trades-intel-league",
        "published": "Thu, 5 Feb 2026 00:51:53 EST",
        "summary_rss": "Kristaps Porzingis is headed to the Warriors, and Giannis is not. Catch up on what we're hearing from insiders.",
        "full_text": "Kristaps Porzingis is headed to the Warriors, and Giannis is not. Catch up on what we're hearing from insiders.",
        "ingested_at": "2026-02-05T16:42:10.527389"
    },
    {
        "source_url": "https://www.espn.com/espn/rss/news",
        "category_group": "Sports",
        "title": "AD is a Wizard?! Grading the trade and who came out on top",
        "link": "https://www.espn.com/nba/story/_/id/47828120/anthony-davis-trade-grade-whats-next-dallas-mavericks-washington-wizards",
        "published": "Thu, 5 Feb 2026 00:51:52 EST",
        "summary_rss": "Kevin Pelton breaks down what's next for the Wizards and the Mavericks.",
        "full_text": "Kevin Pelton breaks down what's next for the Wizards and the Mavericks.",
        "ingested_at": "2026-02-05T16:42:14.061376"
    },
    {
        "source_url": "https://www.espn.com/espn/rss/news",
        "category_group": "Sports",
        "title": "Sources: Dubs deal Kuminga, Hield for Porzingis",
        "link": "https://www.espn.com/nba/story/_/id/47834519/warriors-trading-jonathan-kuminga-buddy-hield-hawks-kristaps-porzingis",
        "published": "Thu, 5 Feb 2026 02:11:08 EST",
        "summary_rss": "The Warriors are trading Jonathan Kuminga and Buddy Hield to the Hawks for Kristaps Porzingis, sources told ESPN, unofficially putting an end to Golden State's pursuit of Giannis Antetokounmpo.",
        "full_text": "The Warriors are trading Jonathan Kuminga and Buddy Hield to the Hawks for Kristaps Porzingis, sources told ESPN, unofficially putting an end to Golden State's pursuit of Giannis Antetokounmpo.",
        "ingested_at": "2026-02-05T16:42:17.156332"
    },
    {
        "source_url": "https://www.espn.com/espn/rss/news",
        "category_group": "Sports",
        "title": "Sources: Tigers land Valdez for 3 years, $115M",
        "link": "https://www.espn.com/mlb/story/_/id/47832764/framber-valdez-detroit-tigers-agree-3-year-115-million-contract",
        "published": "Thu, 5 Feb 2026 02:11:08 EST",
        "summary_rss": "Framber Valdez and the Tigers are in agreement on a three-year, $115 million contract, sources told ESPN's Jeff Passan, the highest average annual value ever for a left-handed pitcher.",
        "full_text": "Framber Valdez and the Tigers are in agreement on a three-year, $115 million contract, sources told ESPN's Jeff Passan, the highest average annual value ever for a left-handed pitcher.",
        "ingested_at": "2026-02-05T16:42:19.711688"
    },
    {
        "source_url": "https://www.espn.com/espn/rss/news",
        "category_group": "Sports",
        "title": "NCAA denies appeal for Ole Miss QB Chambliss",
        "link": "https://www.espn.com/college-football/story/_/id/47833892/ncaa-denies-appeal-ole-miss-qb-chambliss",
        "published": "Thu, 5 Feb 2026 02:11:08 EST",
        "summary_rss": "The NCAA has denied Ole Miss' appeal for Trinidad Chambliss' sixth-year eligibility waiver, which will direct his fight to play college football in 2026 to state court.",
        "full_text": "The NCAA has denied Ole Miss' appeal for Trinidad Chambliss' sixth-year eligibility waiver, which will direct his fight to play college football in 2026 to state court.",
        "ingested_at": "2026-02-05T16:42:22.339957"
    },
    {
        "source_url": "http://sportstechie.net/feed",
        "category_group": "Sports",
        "title": "ASB GlassFloor And Disguise Upgrade Interactive Courts With AR Coaching Tools Animation And Gaming",
        "link": "https://sportstechie.net/asb-glassfloor-and-disguise-upgrade-interactive-courts-with-ar-coaching-tools-animation-and-gaming/",
        "published": "Thu, 22 Jan 2026 02:06:09 +0000",
        "summary_rss": "Disguise and ASB GlassFloor Announce Official Partnership to Upgrade Sports Courts Into Digital Platforms for Fans, Teams and Sponsors ASB GlassFloor, the LED floor technology behind the NBA&#8217;s All-Star Weekend, have announced a partnership with Disguise, the company powering concert visuals for artists including Adele and Beyoncé, to upgrade sports courts into digital platforms for [&#8230;]",
        "full_text": "Sports  Techie ASB GlassFloor, the LED floor technology behind the NBA’s All-Star Weekend, have announced a partnership with Disguise, the company powering concert visuals for artists including Adele and Beyoncé, to upgrade sports courts into digital platforms for fans, teams and sponsors. Disguise and ASB GlassFloor are turning an arena floor into technology-driven, customizable interactive digital surface. The Sports Techie community blog followers and readers, it’s like playing on an NBA 2k style basketball floor complete with game planning capabilities, augmented reality experiences and sponsor driven advertisement activations during a live game, at practice, and whenever the building is in use for other events and activities other than basketball throughout the year. GlassCourt OS This budding strategic relationship flourishes in the cloud thanks to Disguise configuring their servers to host ASB GlassFloor’s operational system feed for the digital court, GLASSCOURT OS. GlassCourt OS is the software ecosystem that powers the LumiFlex ASB GlassFloor, allowing the sports surface to become fully interactive. The intelligent software transforms the ASB GlassFloor into a living, responsive, data-driven sports surface. Adopting the Disguise environment means that, on top of the GLASSCOURT OS solutions, ASB GlassFloor now enables all venues to use the most state-of-the-art media servers in the industry to directly feed interactive content to the floor.  “Through initiatives like our ASB GlassFloor Athletes Lab, we’ve already helped NBA coaches draw plays on their iPad, and see them instantly show up on the digital court floor, alongside real-time player data,” says CEO of ASB GlassFloor, Christof Babinsky. “By partnering with Disguise, we aim to take things even further. We previously worked with Disguise on an interactive LED court at the NBA’s All Star Weekend in 2024 and other events. Following the huge success of these activations, we hope to unify venue AV across more LED floors, banners, jumbotrons, lights and sound so they can be driven from a single system in the future.” Disguise and ASB GlassFloor ASB GlassFloor tech enables coaches to visualize players’ live positions, movement speed and performance metrics, directly on the playing surface, enabling teams to play more efficiently and win more games. Disguise and GlassFloor’s partnership will ensure frame-accurate UHD playback, low latency and stability, so that impressive graphics can be displayed on a massive scale. The companies are also co-developing a suite of apps to offer fans AR games and interactive halftime experiences. Disguise’s media server technology has already helped teams like the Portland Trail Blazers become the first NBA team to broadcast AR graphics from a handheld camera, and has been trusted to drive visual experiences across some of the most high-stakes stadiums and entertainment venues across the world. Combining Disguise’s Emmy Award-winning platform with ASB GlassFloor’s LED court technology and proprietary software enables improved real-time player and ball tracking, displaying live positions, movement and speed, so coaches can analyze performance and fans can become more immersed in the game. To support this goal, ASB GlassFloor and Disguise are co-developing a suite of applications built specifically to offer fans AR games and interactive halftime experiences they can enjoy from any part of the arena. These applications will also allow venues to use the floor for training, competition, fan engagement and non-game-day activations. From AI-assisted defenders in basketball coaching, to traffic safety applications for children and aiding larger, live TV productions on the weekends, the integrated platform aims to drive more traffic, impact, and utilization to existing arena infrastructure.   Key features include multi-layered 8K video playback, animations that respond to gameplay, real-time stats integration, player tracking and interactive games bring live viewership to the next level, whilst being able to enhance performance of professional teams and young players alike. “This partnership highlights a broader industry shift: sports venues are no longer static spaces used only on game day,” says Senior Vice President of Commercial at Disguise, Jake Stone. “Together with ASB GlassFloor, we’ll help teams not only improve their performance, but also increase their revenue by using their arena as an always-on, programmable environment that everyone can benefit from year-round, whether it’s used for a brand product demo or a band’s stadium tour. This is not just about changing how courts look or using LED floors as a novelty, but redefining how sports infrastructure is used for the future.” Disguise Info Disguise is a global technology company driving the next dimension of entertainment. One powerful ecosystem of software, hardware and services offering an end-to-end solution for visual experiences across live events, immersive experiences, virtual production and broadcast. Disguise’s Emmy award-winning Designer software and integrated hardware bring creative visions to life with unrivalled workflows, reliable playback and a Cloud tool suite that offers global collaboration on the most groundbreaking real-time experiences and productions on the planet. Partnering with customers every step of the way, Disguise’s technical and creative services provide seamless, tailored solutions from initial design and content creation through to full implementation, as well as expert training and unbeatable 24/7 global support packages to ensure every project can run without a hitch. Powering experiences for the biggest entertainment companies, studios, venues and brands in the world, from Disney to Snapchat, Netflix to ESPN, the Sydney Opera House to the Burj Khalifa, and Adele to Beyonce, Disguise is everywhere — revolutionizing every sector of the entertainment industry. ASB Info ASB is known for its innovations and sustainable design in the world of sport and has already revolutionized the squash sport market. ASB’s experience and in-depth knowledge of the high-quality materials are incorporated into the most advanced flooring system currently on the market. The full-LED glass court ASB LumiFlex has established itself as a trusted standard in elite competition, approved by players and teams in the German Basketball League, the Euroleague, and the Greek Basketball League. Permanent installations at BMW Park in Munich (home of FC Bayern Munich Basketball) and the OAKA Arena in Athens (home of Panathinaikos Basketball) demonstrate its reliability and acceptance at the highest level. Since 2025, ASB has also been operating its own Athletes Lab in Orlando, giving professional players firsthand experience with the ASB GlassFloor. In addition to basketball, the technology is expanding into several other indoor sports, including volleyball and handball. The product portfolio also includes ASB MultiSports, featuring customizable LED game lines that switch between sports at the touch of a button. Both LumiFlex and MultiSports combine advanced technology with sleek design for unmatched versatility.  ASB GlassFloor is certified by FIBA, IHF, and FIVB and meets all requirements for area-elastic sports floors according to EN 14904. Built with durable glass and aluminum, the floors offer a lifespan of up to 70 years, making them a sustainable, high-performance choice for modern sports facilities. Activations ASB GlassFloor premiered at the FIBA U19 Women’s Basketball World Cup 2023 which was highlighted during an innovation demo presentation in Madrid. It’s was showcased by the University of Kentucky basketball programs Big Blue Madness 2024 at Rupp Arena. As well as at the company’s own state-of-the-art facility in Orlando, the ASB Athletes Lab, developed in collaboration with the NBA. Fans may have also noticed the floor at the 2024 NBA ATT Slam Dunk contest at the Chase Center in San Francisco. As part of the partnership, Disguise’s platform will be used exclusively on all ASB Arena and Event Services floors, as well as ASB GlassFloor sports courts and activations, including the NBA All Star Weekend, FIBA Basketball Champions League Final 4 and the EuroLeague. At the Athletes Lab, cutting edge sports technology enabled teams and clients to see the immersive sports solution in action, as well as acting as a testing ground for future innovation. Disguise and ASB GlassFloor will also provide three full-sized, portable event rental basketball courts that will see usage at marquee sports events across the US and Europe this year. Learn more at www.disguise.one/en and visit www.asbglassfloor.com Sports Techie, where cutting-edge technology meets athlete-focused engineering. Discover a sports flooring solution that enhances performance, reduces joint strain, and offers unparalleled versatility for every sport. Learn more about Disguise via The Sports Techie blog. Designed for the athlete, perfected For performance. NBA All-Star tech company, ASB GlassFloor, is partnering with Disguise to enhance sports courts, the digital, interactive way. See you later sportstechie in Seattle, Atlanta and around the world! Sports Techie Social Media Networks Sports Techie Twitter: @SportsTechieNET:  http://twitter.com/SportsTechieNET THE #SportsTechie Twitter: @THESportsTechie: https://twitter.com/THESportsTechie Sports Techie Facebook Fan Page: http://www.facebook.com/SportsTechie Sports Techie YouTube Channel: http://www.youtube.com/user/sportstechie Sports Techie LinkedIn Group: https://www.linkedin.com/groups/2958439/ Sports Techie LinkedIn (Robert Roble): https://www.linkedin.com/in/robertroble Sports Techie Instagram: http://instagram.com/sportstechie Sports Techie Pinterest: http://pinterest.com/SportsTechie/ Sports Techie Skyword: http://bobroble.skyword.com/ Sports Techie Snapchat, Skype: sportstechie Sports Technology Podcast with Bob Roble. Sports Techie Quora: https://www.quora.com/Bob-Roble Sports Techie Moby Picture: http://www.mobypicture.com/user/sportstechieNET Sports Techie Flickr: http://www.flickr.com/photos/86791607@N04/ Sports Techie Vimeo: https://vimeo.com/user36773456 Sports Techie Guy: https://twitter.com/sportstechieguy  Sports Techie Alignable: https://www.alignable.com/atlanta-ga/sports-techie-llc THESportsTechie Is A Consultant For Videon: https://www.videonlabs.com/ \n\t\t\t\t\tPosted\t\t\t\t \n\t\t\t\t\tin\t\t\t\t \n\t\t\t\t\tby\t\t\t\t Sports Techie  Tags: Sports Techie, sports technology, sports tech Sports  Techie \n\t\tProudly powered by WordPress",
        "ingested_at": "2026-02-05T16:42:25.874922"
    },
    {
        "source_url": "http://sportstechie.net/feed",
        "category_group": "Sports",
        "title": "New Easy To Play Racquet Sport TYPTI Is Prepared For Success On Pickleball Courts",
        "link": "https://sportstechie.net/new-easy-to-play-racquet-sport-typti-is-prepared-for-success-on-pickleball-courts/",
        "published": "Tue, 20 Jan 2026 23:02:26 +0000",
        "summary_rss": "The new sport debuts with professional, amateur, collegiate, and high school competitions, major partnerships, and a growing national infrastructure TYPTI, a new racquet sport that just launched was invented by Steve Bellamy, Chairman and CEO of TYPTI Inc., and founder of the Tennis Channel. The easy to play racquet sport is played on a standard [&#8230;]",
        "full_text": "Sports  Techie TYPTI, a new racquet sport that just launched was invented by Steve Bellamy, Chairman and CEO of TYPTI Inc., and founder of the Tennis Channel. The easy to play racquet sport is played on a standard pickleball court which number in the thousands across North America. All ages and skill levels of players use a standardized 22-inch strung racquet, an innovative 3.5-inch diameter channeled foam ball, and a new scoring system. TYPTI has a slew of blue chip sports and entertainment investors. This launch features a growing national infrastructure in place, a national circuit, major partnerships, and committed top players to strategically and organically help grow the sport rapidly. “We’re creating an infrastructure of tennis and pickleball clubs, entrepreneurs, family offices, racquet sport mavens and lovers, and cities who understand the economic impact of participatory sports,” Bellamy said. “We’re sanctioning tournaments and league teams, and looking for brands wanting to leverage sports to market their products. We’re also scouring the country for amazing players who can be the first generation of TYPTI stars. Basically, we’re building a really smart racquet sport and creating a community for the infrastructure.” TYPTI Specs TYPTI is financed by many strategic investors including Tony Robbins, Drew Brees, Chris Pine, JJ Abrams, Bert Kreischer, Tiffany Haddish, Heather Mills, Kyle MacLachlan, Melissa Rivers, Giovanni Ribisi, Kenny Moore, Jen Prince, Nick Kyrgios, Milos Raonic, Prakash Amritraj, JT Mollner, Gil Henry, David Flaherty, Desiree Gruber, Andrew Segal, Barry Allen and Tony Pritzker to name but a sliver of the nearly 100 blue chip investors. With a novel mixture of badminton and tennis, the enticing sport is nearly noiseless compared to pickleball, and it is considered a low-impact sport that is easy on the body, with low shock at impact and no overhead serve that can be hard on shoulders. TYPTI has an easy learning curve for beginners yet offers chess like sophistication for the pros. The bottom line by design for Bellamy is it’s young at heart appeal and that it’s fun to play for all participants. If you haven’t paid attention, pickleball courts are everyone across the nation. TYPTI launches to the public with professional, amateur, collegiate, and high school competitions, backed by tens of billions of dollars of infrastructure already in place for players to adopt and embrace the sport. The all-skill level national competitive play circuit will begin with the first event on February 25 at the Calabasas Pickleball Club. The professional division will guarantee over $100,000 in total prize money with at least $500,000 of prize money events in year one. Year-two events will have over $1,000,000 in prize money featuring an integrated draw allowing players from all over the US to participate locally to start. Anyone who has a pickleball court now has a TYPTI court. “TYPTI reminds me of snowboarding in 1986,” said Tony Robbins, No. 1 New York Times best-selling author, and the world‘s No. 1 life and business strategist. “Snowboarding exploded profits at ski resorts by adding a second use case to the mountain. That’s what TYPTI will do for pickleball clubs and tennis clubs with pickleball. And the accessibility is unparalleled. While it’s mind-blowing what the top players are doing with the ball, beginners can have great rallies in minutes. That’s not typical for racquet sports, where the barriers of entry prevent the majority from using them as a tool for physical fitness. TYPTI blows the doors off those barriers and will be an unparalleled tool for physical fitness and mental health.” The new sport has inked a number of important partnerships with collegiate, racquet and coaching organizations, including the Racquet Sports Professional Association with over 14,000 teaching pros. “The initial response to TYPTI is VERY positive,” said Brian Dillman, RSPA CEO. “We hosted an introduction to TYPTI in Hawaii and then had a webinar to talk in more detail and our members were captivated. The connection to tennis, additional utilization for pickleball courts, reduced noise and the organization’s tenacity will entice many people to play. We have partnered with TYPTI and will be working to help market the sport and develop coaching models exclusive to RSPA members.” There is also an agreement in place with the Intercollegiate Tennis Association to have a significant prize money collegiate championship. “We’re always looking for ways to enhance the lives of our student athletes,” said David Mullin, ITA CEO. “TYPTI will be a very smart option for some collegiate tennis players as the mechanics of the two sports are so similar.” Bellamy further explained, “I’ve spent my career helping racquet sports grow because they’re a powerful gift to society. Our goal is not to cannibalize other racquet sports like tennis and pickleball, but instead bring the 25 million former players in the U.S. who don’t play anymore back on the court. If they play TYPTI and then migrate to tennis, pickleball, badminton, table tennis or padel, then that will be a huge success for the entire industry.” OLO brand racquets and balls are available at TYPTI.com with more brands coming shortly. “We’re happy to announce the redevelopment of a TYPTI Prince Precision Mono,” said Tim Puttock from Prince Tennis. “We love that they’re being managed with product and excited to be there near the ground floor.”  Check out the TYPTI website Sports Techie, TYPTI offers a new scoring method that is said to uniquely marry risk and reward. It has a hard-working, networked and experienced founder, savvy investors, plenty of necessary infrastructure, unique rackets and balls, its own governing body, and both amateur and professional tours. It also has, ‘show me the money’ prizes if you are talented enough, already in place. What more can you ask for when launching a new sport. What it needs after the launch is high user adoption, homegrown star players, and an international, loyal fanbase that enjoys playing and watching both the tours and tournaments, while viewing live in person, via streaming and on TV, when that time arrives. I hear ESPN/ABC needs fresh content, contact Steve at the TYPTI before their media rights price tag goes way up. See you later sportstechie in Seattle, Atlanta and around the world! Sports Techie Social Media Networks Sports Techie Twitter: @SportsTechieNET:  http://twitter.com/SportsTechieNET THE #SportsTechie Twitter: @THESportsTechie: https://twitter.com/THESportsTechie Sports Techie Facebook Fan Page: http://www.facebook.com/SportsTechie Sports Techie YouTube Channel: http://www.youtube.com/user/sportstechie Sports Techie LinkedIn Group: https://www.linkedin.com/groups/2958439/ Sports Techie LinkedIn (Robert Roble): https://www.linkedin.com/in/robertroble Sports Techie Instagram: http://instagram.com/sportstechie Sports Techie Pinterest: http://pinterest.com/SportsTechie/ Sports Techie Skyword: http://bobroble.skyword.com/ Sports Techie Snapchat, Skype: sportstechie Sports Technology Podcast with Bob Roble. Sports Techie Quora: https://www.quora.com/Bob-Roble Sports Techie Moby Picture: http://www.mobypicture.com/user/sportstechieNET Sports Techie Flickr: http://www.flickr.com/photos/86791607@N04/ Sports Techie Vimeo: https://vimeo.com/user36773456 Sports Techie Guy: https://twitter.com/sportstechieguy  Sports Techie Alignable: https://www.alignable.com/atlanta-ga/sports-techie-llc THESportsTechie Is A Consultant For Videon: https://www.videonlabs.com/  \n\t\t\t\t\tPosted\t\t\t\t \n\t\t\t\t\tin\t\t\t\t \n\t\t\t\t\tby\t\t\t\t Sports Techie  Tags: Sports Techie, sports technology, sports tech Sports  Techie \n\t\tProudly powered by WordPress",
        "ingested_at": "2026-02-05T16:42:27.626556"
    },
    {
        "source_url": "http://sportstechie.net/feed",
        "category_group": "Sports",
        "title": "Nu·Studio Modular And Portable Immersive Studio System Sold By ASG",
        "link": "https://sportstechie.net/nu%c2%b7studio-modular-and-portable-immersive-studio-system-sold-by-asg/",
        "published": "Tue, 20 Jan 2026 15:34:43 +0000",
        "summary_rss": "The Nu·Studio System will debut publicly at the 2026 NAMM Show alongside Avid, with ASG serving as exclusive reseller Nu·Studio offers the first modular, portable studio designed for immersive audiovisual production to artists, broadcasters, producers, and creators, of all types. The Bozeman, MT based company was founded in 2024. Advanced Systems Group (ASG) today announced [&#8230;]",
        "full_text": "Sports  Techie Nu·Studio offers the first modular, portable studio designed for immersive audiovisual production to artists, broadcasters, producers, and creators, of all types. The Bozeman, MT based company was founded in 2024. Advanced Systems Group (ASG) today announced an exclusive partnership with Nu·Studio, enabling ASG to act as exclusive reseller of Nu·Studio, setting the stage for the platform to come to market through its global sales, installation, and service infrastructure. The Sports Techie community blog advises any business or person looking for modern media creation technologies to investigate the Nu·Studio System because it offers a modular, reconfigurable studio platform engineered to support the growing complexity of today’s studio workflows. Nu•Studio will be demonstrated publicly at the 2026 NAMM Show alongside Avid, with ordering available through ASG. Nu·Studio + Advanced Systems Group Nu·Studio was founded by Grammy Award–winning recording engineer and producer Chad Franscoviak, whose more than two decades of experience working in world-class studios and global concert tours shaped the company’s adaptive approach to studio design. “After spending years working in studios around the world, I kept running into the same question: how to design a space that can keep up as the work keeps changing? Nu·Studio grew out of that experience, building a system that’s meant to evolve over time rather than stay fixed in place,” said Franscoviak. “Partnering with ASG gives us the ability to bring that idea to market with the support and longevity it requires.” Nu·Studio’s modular studio environment delivers precision-calibrated immersive audio and video, supports remote collaboration, and ensures consistency across locations to clients in the music, film, motion picture, streaming, sports, technology, podcasting, blogging, and gaming industries. Nu·Studio is a studio infrastructure designed to be adaptable as tech standards and workflows evolve. Built as a modular, reconfigurable acoustic control room, it allows for integrated audiovisual workflows with a portable, non-permanent framework that installs in days and can be relocated or reconfigured as needs change. The exclusive agreement showcases ASG’s 28 years of experience to better manage commercial necessities of the Nu·Studio System’s modular studio environment, including: end-to-end sales, installation, training, and long-term service for media production environments worldwide. This structure allows Nu·Studio to focus on product development and new use-case innovation, while ASG leverages its established global infrastructure to bring the system to market. ASG can provide these services to both independent creatives and large production teams needing modern audiovisual production. Nu·Studio’s design allows artists and production teams to work across multiple formats in a single environment, reducing the need to move between dedicated rooms as projects evolve. “Nu·Studio gives our clients a flexible, scalable solution for a wide range of applications”, said Tom Menrath, ASG’s VP of Audio & Post Production. “This partnership allows us to bring a truly unique modular control room to market that allows our customers to easily pivot as their needs change.” Nu·Studio systems are designed to integrate seamlessly with industry-leading production technologies, including Dolby Atmos and Dolby Vision workflows, enabling consistent, high-quality delivery across music, film, broadcast, and interactive media. ASG is a leading systems integrator and technology reseller serving the media, entertainment, and content production industries. Founded in 1997 and headquartered in Emeryville, CA. Featuring a diverse and expert team of 500+ industry professionals, ASG partners with creators, broadcasters, studios, and enterprises to deliver best-in-class production environments across audio, video, broadcast, post-production, and immersive media workflows. For additional ASG information, visit asgllc.com For more information about Nu·Studio or to inquire about availability, visit nu.studio Sports Techie, Chad designed around this ground-breaking modular, portable studio system concept to be ‘studio as gear’ for immersive audiovisual production. Nu·Studio is considered an adaptive studio systems company building the next generation of production environments for contemporary media creation and beyond. I’ve longed to create a highly rated sports tech podcast and video production studio. The Nu·Studio System seems to be a perfect fit for all types of creator and influencers across many different industries looking for a portable studio fit. Nu•Studio will provide public demos with ASG as the exclusive reseller during the 2026 NAMM Exhibit at the Anaheim Convention Center in SoCal from January 22-24, 2026. Be sure to tell them @TheSportsTechie sent you. See you later sportstechie in Seattle, Atlanta and around the world! Sports Techie Social Media Networks Sports Techie Twitter: @SportsTechieNET:  http://twitter.com/SportsTechieNET THE #SportsTechie Twitter: @THESportsTechie: https://twitter.com/THESportsTechie Sports Techie Facebook Fan Page: http://www.facebook.com/SportsTechie Sports Techie YouTube Channel: http://www.youtube.com/user/sportstechie Sports Techie LinkedIn Group: https://www.linkedin.com/groups/2958439/ Sports Techie LinkedIn (Robert Roble): https://www.linkedin.com/in/robertroble Sports Techie Instagram: http://instagram.com/sportstechie Sports Techie Pinterest: http://pinterest.com/SportsTechie/ Sports Techie Skyword: http://bobroble.skyword.com/ Sports Techie Snapchat, Skype: sportstechie Sports Technology Podcast with Bob Roble. Sports Techie Quora: https://www.quora.com/Bob-Roble Sports Techie Moby Picture: http://www.mobypicture.com/user/sportstechieNET Sports Techie Flickr: http://www.flickr.com/photos/86791607@N04/ Sports Techie Vimeo: https://vimeo.com/user36773456 Sports Techie Guy: https://twitter.com/sportstechieguy  Sports Techie Alignable: https://www.alignable.com/atlanta-ga/sports-techie-llc THESportsTechie Is A Consultant For Videon: https://www.videonlabs.com/  \n\t\t\t\t\tPosted\t\t\t\t \n\t\t\t\t\tin\t\t\t\t \n\t\t\t\t\tby\t\t\t\t Sports Techie  Tags: Sports Techie, sports technology, sports tech Sports  Techie \n\t\tProudly powered by WordPress",
        "ingested_at": "2026-02-05T16:42:29.186606"
    },
    {
        "source_url": "http://sportstechie.net/feed",
        "category_group": "Sports",
        "title": "New Computerized High School Basketball Ratings Solution Launches In Nebraska",
        "link": "https://sportstechie.net/new-computerized-high-school-basketball-ratings-solution-launches-in-nebraska/",
        "published": "Mon, 19 Jan 2026 23:29:32 +0000",
        "summary_rss": "Analytical, computerized rantings, similar to what is used in college and pro sports, is coming to the prep level in Nebraska, beginning with basketball High school basketball in Nebraska is home to Hurrdat Sports and now, NebPreps, a newly launched, analytical and computerized ratings solution. Software driven sport polls are common throughout college and pro [&#8230;]",
        "full_text": "Sports  Techie High school basketball in Nebraska is home to Hurrdat Sports and now, NebPreps, a newly launched, analytical and computerized ratings solution. Software driven sport polls are common throughout college and pro sports; however, the prep landscape was noticeable bare of such a digital asset. Prep basketball in Nebraska debuted this Hurrdat Sports designed, comprehensive computer ratings system built to scale across high school athletics, a few weeks ago beginning with basketball. The Sports Techie community blog chatted with Mike Sautter, Reporter and Content Creator for NebPreps, about the need for such a sports technology product in 2026, how it compliments human complied coaches’ polls, and what the future of the innovative creation looks like. Words like ‘fact-based’ and ‘transparent’ describe their cutting-edge ratings system that provides fans, coaches and the media with a powerful new tool updated on a weekly basis built to evaluate teams and rank them, across Class A, B, C-1, C-2, D-1 and D-2 throughout the season. “High school sports fans deserve the same analytical tools that college and pro sports fans have had for years,” Sautter said. “This fills a gap in Nebraska high school sports coverage with transparent, fact-based ratings that will spark conversation and give fans a deeper understanding of the competitive landscape.” NebPreps Path NebPreps model evaluates teams across six key classifications based on game results, strength of schedule, margin of victory and timing. The system was designed by data analyst, Jeff Swanson, @jeffgswanson, in about a months’ time, to complement traditional coaches’ polls while reducing subjective bias and identifying underrated programs. More and more decisions are data-driven so it’s no surprise to see this trend extend into youth and high school sports. The novel concept was to use algorithms to reshaping evaluation systems beyond the pro level, from recruiting to playoff seeding. This new platform is now available to schools, sports fans, reporters and recruiters. NebPreps computer ratings for boys and girls basketball are available at https://hurrdatsports.com/nebpreps/computer-ratings/. Look for weekly updates published every Monday throughout the regular season with additional sports such as football, to be added in the near future. Why Computer Ratings Matter Computer ratings reduce subjective bias from the ranking process. While human editorial polls rely on perception, reputation and limited observations, the NebPreps computer ratings will evaluate every team based solely on what happens on a court, diamond or field. The result is a comprehensive assessment that: NebPreps, which provides comprehensive coverage, polls and awards for Nebraska high school sports, will continue to publish a weekly coaches poll to give fans both traditional and analytical perspectives. The computer ratings will provide an objective complement to human-driven polls, similar to models used in college sports. How the Ratings System Works The NebPreps computer ratings system is built on a points-based efficiency model that evaluates teams through these key dimensions: “We waited until week five of the high school basketball season to launch the rating system to allow for sufficient data collection,” Sautter said. “Early-season ratings with limited game samples can be unreliable and volatile. By week five, basketball teams have typically played six to eight games, which provides enough information for meaningful initial assessments, while still leaving most of the season ahead.” Ratings are recalculated after each week’s games, so every result matters. A rating of 50 represents an average team in each class, while higher ratings indicate stronger teams. Limitations, Context The computer ratings have limitations: “Our ratings are one lens through which to evaluate teams,” Sautter said. “We encourage fans and analysts to consider ratings alongside traditional polls, expert opinions and their own observations. The best analysis combines multiple perspectives.” Looking Ahead As the season progresses, the NebPreps computer ratings system will: “We’re excited to bring this analytical dimension to Nebraska high school sports,” Sautter said. “We encourage fans to follow NebPreps for weekly updates and join the conversation as we track the 2025-26 high school sports season through data-driven insights.” Hurrdat Sports Hurrdat Sports offers spectators a new, engaging way to consume local sports media in Nebraska. Covering athletic events from Nebraska, Creighton, UNO and everything in between, Hurrdat Sports strives to generate podcasts, video and social media content that contains in-depth coverage, player perspectives and expertise that can’t be found anywhere in the state. Follow Hurrdat Sports on social media at: Facebook, Twitter, Instagram, TikTok, YouTube Media Contact: Kevin Schuster, 402-917-6001, kschuster@lukaspartners.com Sports Techie, I enjoyed speaking with Mike, he’s a very easy going, well-spoken and down-home dude. After doing my due diligence on NebPreps and Hurrdat Sports, I can share the following with certainly. These people pump out relevant content like it’s nobody’s business. They produce nonstop posts, videos and interviews about professional, collegiate and high school sports in Nebraska at an impressive pace. Because of this, the logical question to pose to Mike was whether he gets any sleep? He laughed, and acknowledged at times, not so much! A key point he emphasized several times was how the computer polls aim to become a compliment to human polls, one that keeps coaches poll value in place even though they tend to rank teams the same, week in and week out. The system offers a more comprehensive scope that looks at additional metrics, while attempting to remove bias. The new, data-driven model measures a variety of metrics such as all games, win and losses, margin of victory, opponent strength, home and away, and timing – meaning slightly more weight is given to later games in the schedule compared to early season matchup results. The model is programmed to be more stable 4 or 5 weeks into the hoops season which is about 8 games and after holiday tournaments. He believes it can also offer a better gauge in both divisions and classes. More data equals more accuracy resulting in a more improved method of identifying the best teams going forward. Predicting future performance using the software is an excellent guide for districts and state playoffs. An interesting data point to learn was that boys’ rankings are gathering more traction than the girls. Because women and girl sports are soaring in popularity, I expect it might flip the other way because of the popularity of the WNBA and women’s college basketball and across girls’ high school and youth hoops. One product goal is to replace the wildcard points system used by the NSA for playoff seeding by complimenting it by using a deeper dive and more genuine perspective provided by NebPreps data. Mike also was consistent with sharing the system’s limitations. A key metric such as all the daily injuries that occur are too much manual date entry work at this time, as are entering constantly changing weather factors like snow and wind, in addition to a variety of travel factors. With enough demand, adjustments can be made in time for the next football season making NebPreps more of a true metric measurement and ultimately, a new standard of high school athletics polls. Mike has never seen a media entity such as NebPreps and he has covered high school sports in Nebraska for 15 years. As far as he knows, other states do not offer anything like it. Jeff is a developer and took about a month to design, program and roll out the platform back in August. Mike mentioned their internal tools are a key feature, it has data not currently available to the public yet. He found the lists to be ‘amazing’ and likes the ability to search the data using a drop-down menu that uncovers more statistics. I asked couple more questions. First, is it available to purchase? Mike mentioned.  “The backend is done but the computer rankings system needs to be finetuned before selling through to other states. It is not currently available for purchase.” Where he sees a good immediate fit is as a replacement for a wild card playoff determination. I asked whether a product sponsor was a consideration. He said, “Perhaps, as it (NebPreps) draws more attention, we will look at the numbers, it is only 2 weeks (now 3 weeks) into it. Thus far it is pretty good from an engagement side, it is a wait and see before we run the numbers. The interaction on social media, especially Instagram, has been a positive, with several comments liking the computer rankings over the coach’s poll.” One reason for this is NebPreps can identify teams that fly under the radar better than the coach’s poll. A team can be ninth in the subjective rating but second in the computer rankings. Sautter also mentioned one of the main reasons to create NebPreps was to increase engagement and thus far, it seems to be working, especially on Instagram. Often times engagement comes with negative comments. I wondered how they plan to handle posted complaints about topics like improper ratings or the criteria and resulting metrics. Sautter understood my thought and shared, “Hurrdat Sports celebrates the story differently, we celebrate athletes and teams, emphasizing positivity, in a unique way.”   I voiced a concern about the margin of victory metric. Once coaches understood the system, what prevents schools from running up scores, too often in an unsportsmanlike way, to manipulate the algorithms for better rankings. Mike said, “Victory margin is a play on college basketball and net ratings.” He explained that they hadn’t round tabled this thought but felt it was not something of immediate concern. NebPreps is shared on Mondays, this week will be the third poll release.  Their Nebraska coaches’ poll is released on Sundays, and Mike believes that together with the computer ranking, this unique combination can drive engagement and discussions. My son and I drove from Georgia to Idaho two summer ago including driving all the way through Nebraska. It is cool to put this story about NebPreps next to memories of driving through the state with family, going to see more family, as a means of understanding the ratings, pride and growth of prep sports throughout the state. My gratitude goes out to NebPreps, Hurrdat Sports and to Mike, for sharing this sports tech story. Computerized high school ratings may soon be available in your state.  See you later sportstechie in Seattle, Atlanta and around the world! Sports Techie Social Media Networks Sports Techie Twitter: @SportsTechieNET:  http://twitter.com/SportsTechieNET THE #SportsTechie Twitter: @THESportsTechie: https://twitter.com/THESportsTechie Sports Techie Facebook Fan Page: http://www.facebook.com/SportsTechie Sports Techie YouTube Channel: http://www.youtube.com/user/sportstechie Sports Techie LinkedIn Group: https://www.linkedin.com/groups/2958439/ Sports Techie LinkedIn (Robert Roble): https://www.linkedin.com/in/robertroble Sports Techie Instagram: http://instagram.com/sportstechie Sports Techie Pinterest: http://pinterest.com/SportsTechie/ Sports Techie Skyword: http://bobroble.skyword.com/ Sports Techie Snapchat, Skype: sportstechie Sports Technology Podcast with Bob Roble. Sports Techie Quora: https://www.quora.com/Bob-Roble Sports Techie Moby Picture: http://www.mobypicture.com/user/sportstechieNET Sports Techie Flickr: http://www.flickr.com/photos/86791607@N04/ Sports Techie Vimeo: https://vimeo.com/user36773456 Sports Techie Guy: https://twitter.com/sportstechieguy  Sports Techie Alignable: https://www.alignable.com/atlanta-ga/sports-techie-llc THESportsTechie Is A Consultant For Videon: https://www.videonlabs.com/  \n\t\t\t\t\tPosted\t\t\t\t \n\t\t\t\t\tin\t\t\t\t \n\t\t\t\t\tby\t\t\t\t Sports Techie  Tags: Sports Techie, sports technology, sports tech Sports  Techie \n\t\tProudly powered by WordPress",
        "ingested_at": "2026-02-05T16:42:30.943868"
    },
    {
        "source_url": "http://sportstechie.net/feed",
        "category_group": "Sports",
        "title": "Alex de Minaur Joins Wilson’s Growing Roster Of Tennis 360 Athletes",
        "link": "https://sportstechie.net/alex-de-minaur-joins-wilsons-growing-roster-of-tennis-360-athletes/",
        "published": "Thu, 15 Jan 2026 15:06:34 +0000",
        "summary_rss": "The sporting goods brand is all-in on Tennis, continuing its mission of equipping athletes from head to hand to toe with three new top 20 ATP athletes Wilson Tennis announced today ATP world No. 6 Alex de Minaur is joining their “Tennis 360” Athlete Roster that now features three new top 20 ATP professional tennis players. [&#8230;]",
        "full_text": "Sports  Techie Wilson Tennis announced today ATP world No. 6 Alex de Minaur is joining their “Tennis 360” Athlete Roster that now features three new top 20 ATP professional tennis players. Wilson launched the Tennis 360 initiative in 2023 with current No. 20 ranked Marta Kostyuk and has steadily added to the impressive roster now numbering 16 athletes who inspire, embody and propel, everything the brand does from head to hand to toe. With the start of the Australian Open just days away (Jan 19 – Feb 1, 2026) now is the time to kit up in a new collection, made to play now and always. Wilson leverages their deep-rooted heritage in product excellence and fast-paced innovation to transform the sport of tennis, focused on completing “the kit,” comprised of premium sportswear, rackets, footwear and accessories. The Sports Techie community blog encourages our followers and readers to get ready for tennis season with your favorite kit showcased on Melbourne’s sun-soaked courts. All Wilson® Tennis 360 Athlete’s offer a unique kit fit to their exact needs across each category, providing feedback with product and design experts at Wilson to build the formula that is right for them to excel on-court. “Wilson has been part of my tennis journey since I can remember. I’ve always loved playing with their rackets, and it feels very special to now represent them from head to toe,” says Alex de Minaur. “I love the look and feel of the brand, and the way they bring their kits to life is incredible. I am excited to continue working with Wilson to build upon their legacy and the momentum of the industry at large.” Wilson 360 Athletes The new class of 360 Athletes includes Alex de Minaur, Karen Khachanov, Jiří Lehečka, Anastasia Potapova, Colton Smith and Sarah Rakotomanga; all fitted and playing with Wilsons’ industry-leading rackets. Look for each of these top athletes to support the Wilson research and development team on new product launches across sportswear, footwear and rackets. “Wilson has been in the game for over a century and remains obsessively curious and dedicated to innovating for today’s stars and tomorrow’s legends,” says Gordon Devin, General Manager of Softgoods at Wilson. “We are committed to seeing our athletes thrive, and by building upon our Tennis 360 roster, we are empowering our athletes to compete and win in style.” Longtime Wilson Tennis 360 Athlete, Marta Kostyuk, is often deemed “best dressed” on-tour and has played a crucial role in collaborating with Wilson on sportswear and footwear design. Star in the making, Vicky Mboko, thrived in her breakout year as a Wilson Tennis 360 athlete, jumping from No. 300 to 18 in 2025.  To view Wilson’s full Tennis 360 roster, click over to wilson.com. Wilson Tennis Legacy Wilson’s relationships in tennis have always run deep and been a game-changer– from the brands’ longstanding racket sponsorship with possible GOAT Roger Federer to the WTA’s No. 1, Aryna Sabalenka. Wilson is also the official ball of Roland-Garros and the US Open, providing the best of their brand to the Majors and to athletes across the world. “Wilson has always provided the best athletes in the world with the right equipment to win.  Now more than ever we are confident that equipping the athlete from head to toe to hand really works for them and can elevate their game,” says Jason Collins, Global General Manager of Racquet Sports at Wilson. “This is an exciting time for tennis at large, and we are proud to be at the forefront alongside these exceptional and inspiring athletes.” Watch as Wilson celebrates their commitment to the sport of tennis and to these marquee Tennis 360 Athletes, in Australia and via key touchpoints throughout the year. The first sportswear drop of the year, worn by the pros, is available now in-store and online at wilson.com, in addition to new performance rackets such as the Pro Staff Classic.   Wilson Specs Chicago, USA-based Wilson Sporting Goods Co. is the world’s leading manufacturer of high-performance sports equipment, apparel, footwear and accessories. The Company brings more than a century of innovation and heritage to the world of sport – celebrating the iconic moments made possible by Wilson across Racquet Sports, Baseball, Softball, American Football, Basketball, Volleyball, Soccer and Golf. Wilson is part of Amer Sports, a global group of iconic sports and outdoor brands, publicly traded on the New York Stock Exchange Learn more at wilson.com and follow along @wilson and @wilsontennis. Sports Techie, always on, means the sporting goods brand is all-in on Tennis, continuing its mission of equipping athletes from head to hand to toe with three new top 20 ATP athletes. I like the Blade V9 and Ultra V5 rackets by Wilson. Welcome to Wilson’s “Tennis 360” Athlete Roster, Alex. May you and the global tennis communities, rock your kit to help get into a ‘Tennis State of Mind’. See you later sportstechie in Seattle, Atlanta and around the world! Sports Techie Social Media Networks Sports Techie Twitter: @SportsTechieNET:  http://twitter.com/SportsTechieNET THE #SportsTechie Twitter: @THESportsTechie: https://twitter.com/THESportsTechie Sports Techie Facebook Fan Page: http://www.facebook.com/SportsTechie Sports Techie YouTube Channel: http://www.youtube.com/user/sportstechie Sports Techie LinkedIn Group: https://www.linkedin.com/groups/2958439/ Sports Techie LinkedIn (Robert Roble): https://www.linkedin.com/in/robertroble Sports Techie Instagram: http://instagram.com/sportstechie Sports Techie Pinterest: http://pinterest.com/SportsTechie/ Sports Techie Skyword: http://bobroble.skyword.com/ Sports Techie Snapchat, Skype: sportstechie Sports Technology Podcast with Bob Roble. Sports Techie Quora: https://www.quora.com/Bob-Roble Sports Techie Moby Picture: http://www.mobypicture.com/user/sportstechieNET Sports Techie Flickr: http://www.flickr.com/photos/86791607@N04/ Sports Techie Vimeo: https://vimeo.com/user36773456 Sports Techie Guy: https://twitter.com/sportstechieguy  Sports Techie Alignable: https://www.alignable.com/atlanta-ga/sports-techie-llc THESportsTechie Is A Consultant For Videon: https://www.videonlabs.com/ \n\t\t\t\t\tPosted\t\t\t\t \n\t\t\t\t\tin\t\t\t\t \n\t\t\t\t\tby\t\t\t\t Sports Techie  Tags: Sports Techie, sports technology, sports tech Sports  Techie \n\t\tProudly powered by WordPress",
        "ingested_at": "2026-02-05T16:42:32.617342"
    },
    {
        "source_url": "https://api.foxsports.com/v2/content/optimized-rss?partnerKey=MB0Wehpmuj2lUhuRhQaafhBjAJqaPU244mlTDK1i&size=30&tags=fs/news",
        "category_group": "Sports",
        "title": "Team USA track & field dominates World Athletics Championships",
        "link": "https://www.foxsports.com/stories/other/team-usa-track-field-dominates-world-athletics-championships",
        "published": "Mon, 25 Jul 2022 15:25:14 -0500",
        "summary_rss": "The USA put on a show at the World Athletics Championships, winning an event-record 33 gold medals.",
        "full_text": "POPULAR SEARCHES\n           \n            BROWSE BY\n           For the first time in track and field history, the United States hosted the World Athletics Championships, where some of the globe's best athletes descended upon Eugene, Oregon. And the host nation didn't disappoint. Let's take a look at how the 10-day event unfolded. Outpacing the world Americans racked up 33 medals, 13 of which were gold. Ethiopia secured 10 medals, the second-most. The USA also won the first trophy ever awarded for the team title. Encore for Allyson Felix Allyson Felix competed in a national team uniform for the final time and was up to her old ways.  One of the most decorated athletes in United States history was well on her way to retirement after winning a bronze medal with the 4x400 mixed relay team. She left Oregon, flew to Los Angeles, and was enjoying a cheat meal when she got a call to return and run a prelim race for the women’s 4x400 relay.  She helped the team qualify and then watched her teammates win their third-straight relay gold. Sydney McLaughlin breaks her own record McLaughlin, 22, shattered her own world record in the 400-meter hurdles.  She won in a time of 50.68 on Friday, which was 0.73 seconds better than her previous record. Trailing in third was Dalilah Muhammad, the U.S. silver medalist and previous world record holder from the Tokyo Olympic Games. Noah Lyles sets new U.S. record Lyles not only won the 200 meters, but he broke Michael Johnson’s U.S. record of 19.32 that was set in 1996 with a time of 19.31. Johnson was part of the BBC’s coverage team and personally congratulated Lyles. Athing Mu accomplishes an American first Mu held off Great Britain’s Keely Hodgkinson to become the first American woman to win the 800 at the World Championships. She ran a time of 1:56.30, the fastest time in the world this year. Other highlights from around the world Tobi Amusan, an NCAA champion at Texas-El Paso, stunned the world when she broke the women’s 100m world record (12.20) with a time of 12.12 to solidify her spot in the finals. She went on to win gold and became the first Nigerian to win gold at the championships. Mondo Duplantis, a Louisiana native who competes for Sweden, won gold in men’s pole vault by raising his own world record to 6.21 meters. American medal performances Gold Silver Bronze",
        "ingested_at": "2026-02-05T16:42:36.849579"
    },
    {
        "source_url": "https://api.foxsports.com/v2/content/optimized-rss?partnerKey=MB0Wehpmuj2lUhuRhQaafhBjAJqaPU244mlTDK1i&size=30&tags=fs/news",
        "category_group": "Sports",
        "title": "Are the 2022 Oklahoma Sooners the best softball team ever?",
        "link": "https://www.foxsports.com/stories/other/are-the-2022-oklahoma-sooners-the-best-softball-team-ever",
        "published": "Fri, 10 Jun 2022 02:07:41 -0500",
        "summary_rss": "With Oklahoma softball going back-to-back, Jordan Shusterman looks at how the Sooners built a dynasty — and whether it can continue.",
        "full_text": "With Oklahoma softball going back-to-back, Jordan Shusterman looks at how the Sooners built a dynasty — and whether it can continue.",
        "ingested_at": "2026-02-05T16:42:38.776119"
    },
    {
        "source_url": "https://api.foxsports.com/v2/content/optimized-rss?partnerKey=MB0Wehpmuj2lUhuRhQaafhBjAJqaPU244mlTDK1i&size=30&tags=fs/news",
        "category_group": "Sports",
        "title": "Women's College World Series: Players to watch on UCLA, Texas, Oklahoma & the rest",
        "link": "https://www.foxsports.com/stories/other/womens-college-world-series-players-to-watch-on-ucla-texas-oklahoma-the-rest",
        "published": "Wed, 01 Jun 2022 14:57:33 -0500",
        "summary_rss": "With the WCWS beginning Thursday, Jordan Shusterman identifies the player on every team that softball fans need to know.",
        "full_text": "POPULAR SEARCHES\n           \n            BROWSE BY\n           By Jordan ShustermanFOX Sports MLB Writer It’s quite simply one of the best events on the sports calendar.  The Women’s College World Series begins Thursday, headlined by the 54-2 Oklahoma Sooners looking to defend their crown after they won their fifth national championship in 2021. If you haven’t hopped on the softball hype train already, it’s about time you do so. Four of the eight teams from last year’s edition of the WCWS — Oklahoma, Oklahoma State, UCLA and Arizona — return to Oklahoma City this year, and four others round out the field for what should be a fantastic week of softball.  Here are the players from each team that you need to know before the games begin:  UCLA: Delanie Wisz, C/3B  The Bruins are making their Division I-record 34th appearance at the Women’s College World Series after an undefeated run through the regional and super-regional rounds, and Wisz has been a huge part of that. She is one of several fifth-year seniors on UCLA’s roster coming into OKC with ample postseason experience, though she wasn't on the team for the championship run in 2019; Wisz played two years at Loyola Marymount before transferring to UCLA for the 2020 season.  Her defensive versatility is awfully valuable on its own, but she has also had a career year at the plate, hitting .407 with 14 home runs as UCLA’s primary three-hole hitter. Look for her to continue to shine in the middle of the Bruins’ lineup as they go for their 14th national championship.  Other players to watch: SS Briana Perez (1.188 OPS), CF Maya Brady (13 HRs; Tom Brady’s niece), SP Megan Faraimo (1.70 ERA), SP Holly Azevedo (1.19 ERA)  Texas: Hailey Dolcini, SP The Longhorns return to the WCWS for the first time since 2013, and it’s safe to say they couldn’t have done it without Dolcini, who has had quite the journey over her collegiate career and now gets the chance to show off her ability on the game’s biggest stage. A California native, Dolcini played her freshman season at UC-Riverside before transferring to Fresno State, where she became an All-American pitcher and dominated in the Mountain West Conference.  With the additional year of eligibility granted to all players following the canceled 2020 season, Dolcini decided to take another step up in competition and transfer to Texas. She immediately stepped in as the ace for the Longhorns, posting a 2.19 ERA in 195 innings. Most notably, she threw a complete game against mighty Oklahoma to end the Sooners' 40-game winning streak and hand OU one of only two losses of the season back on April 16, so you know she won’t be intimidated should Texas face Oklahoma again at some point in OKC. Other players to watch: 2B Janae Jefferson (1.151 OPS), C Mary Iakopo (10 HRs), SP Sophia Simpson (102 Ks in 83 IP) Oklahoma: Grace Lyon, SS As the defending champions and heavy favorites entering this weekend, the Sooners have such an overwhelming amount of talent that it becomes difficult to highlight just one player. The objectively correct player to focus on is still slugger Jocelyn Alo, the all-time home run queen who is looking to cap off her spectacular career with another national title. Or you could look to dazzling freshman Jordy Bahl, who has posted a ridiculous 0.95 ERA with 199 strikeouts in 132.1 IP, though she has dealt in recent weeks with injuries that leave her status for the WCWS somewhat questionable.  Lyons, though, has stepped up in a huge way this season. Already regarded as one of the best defensive shortstops in the country, Lyons took a big step forward on offense in 2022, as she launched a career-high 21 HRs and drove in 62 runs, third on the team behind only Alo and sophomore sensation (and double-play partner) Tiare Jennings. Lyons has always been one of the best players in the country, but her excellence has been somewhat obscured by all the star power on the Sooners' roster. In her senior year, Lyons is finally getting the love she deserves, and she'll surely be a crucial factor if Oklahoma is to repeat as champion.  Other players to watch: Alo (29 HRs, 1.797 OPS), Bahl (0.95 ERA in 132.1 IP), SP Hope Trautwein (0.40 ERA in 104.1 IP), CF Jayda Coleman (1.249 OPS), 2B Tiare Jennings (24 HRs) Northwestern: Danielle Williams, SP Easily one of the most fun parts of softball is that ace starting pitchers throw a much higher percentage of innings for their teams than any baseball pitchers could ever dream of — or at least, any baseball pitchers in the past 100 years. Williams is this year’s premier example of a starting pitcher who has completely put her team on her back down the stretch, as she has pitched a staggering 91.5% of the Wildcats’ innings this postseason.  That includes an unbelievable 430 pitches over the three-game super-regional last weekend against Arizona State, and the senior left-hander does it all with an infectious smile on her face. She’s a delight to watch and a tremendous talent for an exciting Northwestern program making its first trip to the WCWS since 2007. Other players to watch: OF Rachel Lewis (22 HRs), C Jordyn Rudd (.375 BA), SS Maeve Nelson (12 HRs) Florida: Skylar Wallace, SS Incredibly, this will be the first WCWS since 2007 without multiple representatives from the SEC, as the Gators were the conference's only team to make it to OKC after a slew of upsets in the first two rounds, including hosts Alabama, Missouri and Tennessee all losing in regionals and Arkansas and Mississippi State being eliminated in super-regionals. Florida, meanwhile, prevailed despite dropping Game 1 in the best-of-three against No. 3 Virginia Tech.  The Gators are led on offense by Wallace, who is in her first season with Florida after transferring from conference rival Alabama and sitting out the 2021 season. While the Gators don’t have the same level of power (just 37 HRs in 65 games) as some of the other teams in OKC, they outpace the field in another category: stolen bases. Florida’s 131 steals are tied for fourth in Division I and rank first among WCWS teams by a mile (Texas is next with 92); 51 of those belong to Wallace, tied for second-most in Division I. Wallace also leads the team in extra-bases hits, with 25, so she is not merely a speedster but an all-around star.  Other players to watch: CF Kendra Falby (.962 OPS, 36 stolen bases), 2B Hannah Adams (.969 OPS), 3B Charla Echols (19 XBH), SP Elizabeth Hightower (2.44 ERA in 163.2 IP) Oregon State: Mariah Mazon, two-way player Mazon has racked up some truly eye-popping numbers in the circle over her five-year career with the Beavers: a 2.21 ERA with 861 strikeouts in 866 (!!!) innings pitched. And this year, she also leveled up on offense in a significant way. She didn’t hit much in her first two years in Corvallis, but she started getting regular at-bats in 2020 and is capping off her career in impressive fashion: by hitting .366 with 12 HRs this season when she wasn’t busy being the Beavers’ ace.   With the team making its first trip to the WCWS since 2006, this is a tremendous opportunity for the Beavers. They were below .500 just last season, and there’s no one better to lead the way than the veteran Mazon. Other players to watch: 1B Frankie Hammoude (15 HRs), 2B Kiki Escobar (.343 BA), SP Sarah Haendiges (1.97 ERA in 137 IP) Oklahoma State: Chyenne Factor, CF The Cowgirls return to OKC for the 14th time, though they also have the unfortunate distinction of being the program with the most trips to the WCWS without winning a title. They should have an excellent chance to change that this season, thanks to an elite pitching staff led by Kelly Maxwell. But here I’ll highlight Factor, who has been a force on both sides of the ball during her career in Stillwater and has continued to excel in her senior campaign, including a homer earlier this season off National Player of the Year candidate Georgina Corrick. Another fun Factor fact: Her brother, Cross, who played briefly at Oklahoma State in 2019, led NAIA in batting average this year, with a stunning .525 mark, and he finished second nationally in home runs with 30 for the Oklahoma City University Stars.  Other players to watch: OF Katelynn Carwile (.353 BA), two-way player Miranda Elish (2.09 ERA in 104 IP; 1.062 OPS), 3B Sydney Pennington (10 HR), SP Kelly Maxwell (1.16 ERA in 169 IP) Arizona: Carlie Scupin, 1B With the retirement of legendary head coach Mike Candrea after the 2021 season, all eyes were on his replacement — former Wildcat player Caitlin Lowe — to see if this historic program could continue to thrive. Sure enough, they’re right back in Oklahoma City for the 29th time, most of any Division I program not called UCLA.  There are plenty of sluggers worth spotlighting for an Arizona team that hit 95 home runs, which ranked ninth in Division I and trails only Oklahoma among teams in the WCWS field. Scupin (19 HRs) has been one of the biggest power threats for the Wildcats in 2022, and her crouched stance and uppercut swing are especially entertaining. Still just a sophomore, she might be only scratching the surface of her potential. Other players to watch: C Sharlize Palacios (19 HRs), 2B Allie Skaggs (24 HRs), SP Hanah Bowen (3.67 ERA in 129.2 IP) Jordan Shusterman is half of @CespedesBBQ and a baseball writer for FOX Sports. He lives in D.C. but is a huge Seattle Mariners fan and loves watching the KBO, which means he doesn't get a lot of sleep. You can follow him on Twitter @j_shusterman_.",
        "ingested_at": "2026-02-05T16:42:41.989673"
    },
    {
        "source_url": "https://api.foxsports.com/v2/content/optimized-rss?partnerKey=MB0Wehpmuj2lUhuRhQaafhBjAJqaPU244mlTDK1i&size=30&tags=fs/news",
        "category_group": "Sports",
        "title": "Thompson-Herah runs 10.54, Richardson finishes ninth at Prefontaine",
        "link": "https://www.foxsports.com/stories/other/shacarri-richardson-elaine-thompson-herah-prefontaine-classic-women-100-meters",
        "published": "Sat, 21 Aug 2021 17:21:46 -0500",
        "summary_rss": "Sha'Carri Richardson didn't have a glorious return at the Prefontaine Classic, while Elaine Thompson-Herah dominated – again.",
        "full_text": "POPULAR SEARCHES\n           \n            BROWSE BY\n           It wasn't the return that anyone expected.  United States track star Sha'Carri Richardson made her return to competition on Saturday at Nike's Prefontaine Classic, where she would match up with Olympic gold medalist Elaine Thompson-Herah.  However, it was more of a mismatch than anything.  Thompson-Herah blew Richardson – and the rest of the field – away, running a 10.54, the second-fastest 100-meter time in women's track history, trailing only Florence Griffith Joyner's 10.49 run at the 1988 U.S. Olympic trials. Richardson, somewhat shockingly, finished last with a time of 11.14. Saturday's result comes just weeks after Thompson-Herah broke Joyner's 100-meter Olympic record of 10.62 by posting a 10.61 en route to winning gold in Tokyo.  Still, there was some thought that if Richardson had raced in Tokyo – she was suspended due to a marijuana violation – maybe she could have challenged Thompson-Herah, considering Richardson's 10.72 in April of this year is the sixth-fastest 100m time in women's history.  And Richardson had the powerful backing that made Saturday's race all the more intriguing.  First, Kanye West showed his support.  Then, Nike added its own. Any speculation as to who is the fastest woman on Earth ended on Saturday, at least until the two take the track again.  As always, Twitter had something to say. Here's social media's reaction to Saturday's surprising result, including that of Emmanuel Acho from \"Speak For Yourself\": As for Richardson, she spoke on the track after the race and warned doubters about counting her out because of Saturday's underwhelming performance.  The silver lining in all of this? Richardson turned 21 in March.  Time is on her side, even if Twitter is not.",
        "ingested_at": "2026-02-05T16:42:43.925162"
    },
    {
        "source_url": "https://api.foxsports.com/v2/content/optimized-rss?partnerKey=MB0Wehpmuj2lUhuRhQaafhBjAJqaPU244mlTDK1i&size=30&tags=fs/news",
        "category_group": "Sports",
        "title": "Joey Chestnut wins Nathan's Hot Dog Eating Contest: Here's what you need to know",
        "link": "https://www.foxsports.com/stories/other/joey-chestnut-july-4-nathans-hot-dog-eating-contest",
        "published": "Sun, 04 Jul 2021 13:11:12 -0500",
        "summary_rss": "Joey Chestnut has won his fifth straight Nathan's Hot Dog Eating Contest. Here's what you need to know about this July 4 event.",
        "full_text": "POPULAR SEARCHES\n           \n            BROWSE BY\n           July 4 is about celebrating Independence Day, enjoying time with family, watching some fireworks and perhaps eating a hot dog … or 70. Well, maybe not 70 for most people. But if you were paying any attention to the Nathan’s Hot Dog Eating Contest on Sunday, you got to watch a few folks at least make the attempt. As has become tradition, Joey Chestnut once again dominated the event, stuffing 76 hot dogs into his face in 10 minutes to break the world record he set just last year. Chestnut, 37, has won the event five straight times and 14 of the past 15. On the women's side, Michelle Lesco won the belt by downing just shy of 31 dogs in 10 minutes. Miki Sudo, who set the women's record at 48.5 last year, would have been favored to win the event, but she opted to work out of the ESPN booth this year during her pregnancy. Here are some other things to know about the competition, a sanctioned celebration of gluttony that has become an American tradition. Why does this exist? Humans are competitive creatures and love to eat, so it shouldn’t be too surprising that competitive eating is a thing around the world or that professional eaters compete in contests and are governed by such outfits as Major League Eating. Right? Nathan’s is a hot dog eating contest, but there are also competitions centered on other foods, including hamburgers, pies, pancakes, wings, pizza and ribs. Apparently, eating contests date back at least as far as the 13th century and the first recorded pie-eating contest took place in Toronto in 1878. According to Nathan's, the origins of the hot dog eating contest date to July 4, 1916, when four immigrants decided that would be the best way to determine which of them was the most patriotic. How does the Nathan’s contest work? It’s pretty simple. Competitors have 10 minutes to eat as many hot dogs (including buns) as they can. They have to be members of MLE and must qualify for Nathan’s through various regional events. The contestants can consume the dogs and buns separately and are allowed to dunk the buns in water, but they can be penalized for \"messy eating\" and disqualified if they – ahem – lose their lunch. The winners earn $10,000 and the \"Mustard Belt.\" Anything else? If you thought you had a bad post-BBQ stomachache today, imagine how Chestnut must feel.",
        "ingested_at": "2026-02-05T16:42:47.137242"
    },
    {
        "source_url": "https://techcrunch.com/feed/",
        "category_group": "Tech",
        "title": "Sam Altman got exceptionally testy over Claude Super Bowl ads",
        "link": "https://techcrunch.com/2026/02/04/sam-altman-got-exceptionally-testy-over-claude-super-bowl-ads/",
        "published": "Thu, 05 Feb 2026 00:45:11 +0000",
        "summary_rss": "He posted a novella-sized rant that devolved into to calling his rival \"dishonest\" and \"authoritarian.\"",
        "full_text": "Latest\t\n \n\n\t\tAI\t\n \n\n\t\tAmazon\t\n \n\n\t\tApps\t\n \n\n\t\tBiotech & Health\t\n \n\n\t\tClimate\t\n \n\n\t\tCloud Computing\t\n \n\n\t\tCommerce\t\n \n\n\t\tCrypto\t\n \n\n\t\tEnterprise\t\n \n\n\t\tEVs\t\n \n\n\t\tFintech\t\n \n\n\t\tFundraising\t\n \n\n\t\tGadgets\t\n \n\n\t\tGaming\t\n \n\n\t\tGoogle\t\n \n\n\t\tGovernment & Policy\t\n \n\n\t\tHardware\t\n \n\n\t\tInstagram\t\n \n\n\t\tLayoffs\t\n \n\n\t\tMedia & Entertainment\t\n \n\n\t\tMeta\t\n \n\n\t\tMicrosoft\t\n \n\n\t\tPrivacy\t\n \n\n\t\tRobotics\t\n \n\n\t\tSecurity\t\n \n\n\t\tSocial\t\n \n\n\t\tSpace\t\n \n\n\t\tStartups\t\n \n\n\t\tTikTok\t\n \n\n\t\tTransportation\t\n \n\n\t\tVenture\t\n \n\n\t\tStaff\t\n \n\n\t\tEvents\t\n \n\n\t\tStartup Battlefield\t\n \n\n\t\tStrictlyVC\t\n \n\n\t\tNewsletters\t\n \n\n\t\tPodcasts\t\n \n\n\t\tVideos\t\n \n\n\t\tPartner Content\t\n \n\n\t\tTechCrunch Brand Studio\t\n \n\n\t\tCrunchboard\t\n \n\n\t\tContact Us\t\n Anthropic’s Super Bowl commercial, one of four ads the AI lab dropped on Wednesday, begins with the word “BETRAYAL” splashed boldly across the screen. The camera pans to a man earnestly asking a chatbot (obviously intended to depict ChatGPT) for advice on how to talk to his mom. The bot, portrayed by a blonde woman, offers some classic bits of advice. Start by listening. Try a nature walk! And then twists into an ad for a fictitious (we hope!) cougar-dating site called Golden Encounters. Anthropic finishes the spot by saying that while ads are coming to AI, they won’t be coming to its own chatbot, Claude. Another commercial features a slight young man looking for advice on building a six pack. After offering his height, age, and weight, the bot serves him an ad for height-boosting insoles. The Anthropic commercials are cleverly aimed at OpenAI’s users, after that company’s recent announcement that ads will be coming to ChatGPT’s free tier. And they caused an immediate stir, spawning headlines that Anthropic “mocks,” “skewers,” and “dunks on” OpenAI. They are funny enough that even Sam Altman admitted on X that he laughed at them. But he clearly didn’t really find them funny. They inspired him to write a novella-sized rant that devolved into calling his rival “dishonest” and “authoritarian.” First, the good part of the Anthropic ads: they are funny, and I laughed.But I wonder why Anthropic would go for something so clearly dishonest. Our most important principle for ads says that we won’t do exactly this; we would obviously never run ads in the way Anthropic… In that post, Altman explains that an ad-supported tier is intended to shoulder the burden of offering free ChatGPT to many of its millions of users. ChatGPT is still the most popular chatbot by a large margin. But the OpenAI CEO insisted the ads were “dishonest” in implying that ChatGPT will twist a conversation to insert an ad (and possibly for an off-color product, to boot).”We would obviously never run ads in the way Anthropic depicts them,” Altman wrote in the social media post. “We are not stupid and we know our users would reject that.” Indeed, OpenAI has promised ads will be separate, labeled, and will never influence a chat. But the company has also said it is planning on making them conversation-specific — which is the central allegation of Anthropic’s ads. As OpenAI explained on its blog, “We plan to test ads at the bottom of answers in ChatGPT when there’s a relevant sponsored product or service based on your current conversation.” Altman then went on to fling some equally questionable assertions at his rival. “Anthropic serves an expensive product to rich people,” he wrote. “We also feel strongly that we need to bring AI to billions of people who can’t pay for subscriptions.” But Claude has a free chat tier, too, with subscriptions at $0, $17, $100, and $200. ChatGPT’s tiers are $0, $8, $20, and $200. One could argue the subscription tiers are fairly equivalent. Altman also alleged in his post that “Anthropic wants to control what people do with AI.” He argues it blocks usage of Claude Code from “companies they don’t like,” like OpenAI, and said Anthropic tells people what they can and can’t use AI for. True, Anthropic’s whole marketing deal since day one has been “responsible AI.” The company was founded by two former OpenAI alums, after all, who claimed they grew alarmed about AI safety when they worked there. Still, both chatbot companies have usage policies, AI guardrails, and talk about AI safety. And while OpenAI allows ChatGPT to be used for erotica while Anthropic does not, OpenAI, like Anthropic, has determined that some content should be blocked, particularly in regards to mental health. Yet Altman took this Anthropic-tells-you-what-to-do argument to an extreme level when he accused Anthropic of being “authoritarian.” “One authoritarian company won’t get us there on their own, to say nothing of the other obvious risks. It is a dark path,” he wrote. Using “authoritarian” in a rant over a cheeky Super Bowl ad is misplaced, at best. It’s particularly tactless when considering the current geopolitical environment in which protesters around the world have been killed by agents of their own government. While business rivals have been duking it out in ads since the beginning of time, clearly Anthropic hit a nerve. Topics \nVenture Editor\n Tickets are live at the lowest rates of the year. Save up to $680 on your pass now.Meet investors. Discover your next portfolio company. Hear from 250+ tech leaders, dive into 200+ sessions, and explore 300+ startups building what’s next. Don’t miss these one-time savings.  Homeland Security is trying to force tech companies to hand over data about Trump critics\n  Fintech CEO and Forbes 30 Under 30 alum has been charged for alleged fraud\n  Two Stanford students launch $2M startup accelerator for students nationwide\n  Notepad++ says Chinese government hackers hijacked its software updates for months\n  Meet the new European unicorns of 2026\n  Nvidia CEO pushes back against report that his company’s $100B OpenAI investment has stalled\n  OpenClaw’s AI assistants are now building their own social network\n © 2025 TechCrunch Media LLC.",
        "ingested_at": "2026-02-05T16:42:49.513068"
    },
    {
        "source_url": "https://techcrunch.com/feed/",
        "category_group": "Tech",
        "title": "As it preps Specs for the masses, Snap’s Q4 shows revenue growth but fewer daily users",
        "link": "https://techcrunch.com/2026/02/04/as-it-preps-specs-for-the-masses-snaps-q4-shows-revenue-growth-but-fewer-daily-users/",
        "published": "Thu, 05 Feb 2026 00:07:59 +0000",
        "summary_rss": "The company is engaged in a strategy to diversify its revenue sources as it heads into the new year.",
        "full_text": "Latest\t\n \n\n\t\tAI\t\n \n\n\t\tAmazon\t\n \n\n\t\tApps\t\n \n\n\t\tBiotech & Health\t\n \n\n\t\tClimate\t\n \n\n\t\tCloud Computing\t\n \n\n\t\tCommerce\t\n \n\n\t\tCrypto\t\n \n\n\t\tEnterprise\t\n \n\n\t\tEVs\t\n \n\n\t\tFintech\t\n \n\n\t\tFundraising\t\n \n\n\t\tGadgets\t\n \n\n\t\tGaming\t\n \n\n\t\tGoogle\t\n \n\n\t\tGovernment & Policy\t\n \n\n\t\tHardware\t\n \n\n\t\tInstagram\t\n \n\n\t\tLayoffs\t\n \n\n\t\tMedia & Entertainment\t\n \n\n\t\tMeta\t\n \n\n\t\tMicrosoft\t\n \n\n\t\tPrivacy\t\n \n\n\t\tRobotics\t\n \n\n\t\tSecurity\t\n \n\n\t\tSocial\t\n \n\n\t\tSpace\t\n \n\n\t\tStartups\t\n \n\n\t\tTikTok\t\n \n\n\t\tTransportation\t\n \n\n\t\tVenture\t\n \n\n\t\tStaff\t\n \n\n\t\tEvents\t\n \n\n\t\tStartup Battlefield\t\n \n\n\t\tStrictlyVC\t\n \n\n\t\tNewsletters\t\n \n\n\t\tPodcasts\t\n \n\n\t\tVideos\t\n \n\n\t\tPartner Content\t\n \n\n\t\tTechCrunch Brand Studio\t\n \n\n\t\tCrunchboard\t\n \n\n\t\tContact Us\t\n Snap is on a mission to diversify its revenue sources — moving from a business model in which it largely chases ad revenue to one where it can also make money through subscriptions and, eventually, hardware. The company’s latest quarterly earnings report shows that, so far, the firm is having moderate success with that strategy. In Q4, Snap’s revenue was $1.7 billion, which is up 10% year-over-year. Its average revenue per user was also up, slightly (to $3.62 from $3.44). The company’s net income was $45 million, up from $9 million the previous year, its earnings report shows. The company has also continued to generate a significant amount of revenue from Snap+, the paid subscription service that the platform launched back in 2022. The service’s subscribers grew 71% year-over-year, reaching 24 million. While those numbers might seem to suggest a company whose trajectory is headed in the right direction, the earnings report also shows the platform had slightly fewer daily active users last quarter — dropping from 477 million to 474 million. Those users fell away in North America and Europe, the report shows, while growing slightly throughout the rest of the world. Reuters also reports that the company expects its revenue during the first quarter of this year to be below analysts’ previous estimates, as competition from Facebook, Instagram, and TikTok cuts into its advertising earnings. During Wednesday’s earnings call, CEO Evan Spiegel focused on the company’s newer offerings, including its recent effort to charge users for Memories storage — a feature that lets users save and store their Snaps — and its plans to launch Specs later this year. The company has not launched a public-facing version of the augmented-reality glasses since 2019. In anticipation of that event, Snap recently announced the creation of a new subsidiary, Specs Inc., that is focused solely on further developing the glasses. “Our long-term vision for augmented reality extends beyond the smartphone to a future when computing is more natural, contextual and seamlessly integrated into the real world,” said Spiegel. The CEO added that it was important to develop a “strong standalone brand” for Specs, as he said the hardware product could appeal “to a different audience segment” than the “core Snapchat audience.” That said, it sounds like the strategy behind Specs may not be entirely ironed out yet. Later in the conversation, Spiegel continued: “We’re so close to launch that the key here is really just, you know, nailing the launch and making sure that we deliver an extraordinary product. And then, you know, I think we have a lot of flexibility to think about how we want to capitalize [on] it moving forward.” Topics \nSenior Writer, TechCrunch\n Tickets are live at the lowest rates of the year. Save up to $680 on your pass now.Meet investors. Discover your next portfolio company. Hear from 250+ tech leaders, dive into 200+ sessions, and explore 300+ startups building what’s next. Don’t miss these one-time savings.  Homeland Security is trying to force tech companies to hand over data about Trump critics\n  Fintech CEO and Forbes 30 Under 30 alum has been charged for alleged fraud\n  Two Stanford students launch $2M startup accelerator for students nationwide\n  Notepad++ says Chinese government hackers hijacked its software updates for months\n  Meet the new European unicorns of 2026\n  Nvidia CEO pushes back against report that his company’s $100B OpenAI investment has stalled\n  OpenClaw’s AI assistants are now building their own social network\n © 2025 TechCrunch Media LLC.",
        "ingested_at": "2026-02-05T16:42:51.396367"
    },
    {
        "source_url": "https://techcrunch.com/feed/",
        "category_group": "Tech",
        "title": "Mundi Ventures closes on €750M for Kembara, its largest deep tech and climate fund",
        "link": "https://techcrunch.com/2026/02/04/mundi-ventures-closes-on-e750m-for-kembara-its-largest-deep-tech-and-climate-fund/",
        "published": "Thu, 05 Feb 2026 00:01:00 +0000",
        "summary_rss": "Spain-based deeptech and climate megafund Kembara has just completed a €750 million first close toward its €1 billion target.",
        "full_text": "Latest\t\n \n\n\t\tAI\t\n \n\n\t\tAmazon\t\n \n\n\t\tApps\t\n \n\n\t\tBiotech & Health\t\n \n\n\t\tClimate\t\n \n\n\t\tCloud Computing\t\n \n\n\t\tCommerce\t\n \n\n\t\tCrypto\t\n \n\n\t\tEnterprise\t\n \n\n\t\tEVs\t\n \n\n\t\tFintech\t\n \n\n\t\tFundraising\t\n \n\n\t\tGadgets\t\n \n\n\t\tGaming\t\n \n\n\t\tGoogle\t\n \n\n\t\tGovernment & Policy\t\n \n\n\t\tHardware\t\n \n\n\t\tInstagram\t\n \n\n\t\tLayoffs\t\n \n\n\t\tMedia & Entertainment\t\n \n\n\t\tMeta\t\n \n\n\t\tMicrosoft\t\n \n\n\t\tPrivacy\t\n \n\n\t\tRobotics\t\n \n\n\t\tSecurity\t\n \n\n\t\tSocial\t\n \n\n\t\tSpace\t\n \n\n\t\tStartups\t\n \n\n\t\tTikTok\t\n \n\n\t\tTransportation\t\n \n\n\t\tVenture\t\n \n\n\t\tStaff\t\n \n\n\t\tEvents\t\n \n\n\t\tStartup Battlefield\t\n \n\n\t\tStrictlyVC\t\n \n\n\t\tNewsletters\t\n \n\n\t\tPodcasts\t\n \n\n\t\tVideos\t\n \n\n\t\tPartner Content\t\n \n\n\t\tTechCrunch Brand Studio\t\n \n\n\t\tCrunchboard\t\n \n\n\t\tContact Us\t\n Europe invests billions into early-stage climate startups, only to watch too many fail at Series B, according to a recent report. But new funds are being raised to fill this gap, and Spain-based Mundi Ventures’ latest fund, Kembara Fund I, is one of them. After securing a €350 million commitment from the European Investment Fund under the European Tech Champions Initiative in 2024, Mundi Ventures has just completed a €750 million first close for Kembara, its fifth fund and largest to date.  Regulatory filing from Spain reveals that the fund — focused on deep tech — could even stretch its final closing to €1.25 billion. But according to Kembara co-founder and general partner Yann de Vries, getting to €750 million in two years as a first fund in this environment “was not easy.” Kembara is managed by a specialist team within Mundi Ventures, with offices in Madrid, London, Barcelona, and Paris. Mundi Ventures founder Javier Santiso is now also a co-founder and GP of the Kembara fund, which has now disclosed the full list of its senior partners. Alongside de Vries and Santiso, climate tech VC Robert Trezona and deep tech VC Pierre Festal have also joined as general partners, as well as former Atomico partner Siraj Khaliq as senior strategic advisor. (Pictured from left to right: Javier Santiso, Siraj Khaliq, Robert Trezona, Yann de Vries and Pierre Festal.) Their individual track records helped them raise funds from institutional backers waking up to the need for European growth capital that can turn its many university spinouts into sizable businesses with industrial synergies. But it also gave them a front-row seat into the broader growing pains of European climate and deep tech startups — especially de Vries.  A seasoned venture capitalist who founded Redpoint eVentures Brazil and later became a partner at Atomico, de Vries had moved to the other side of the table to join German electric aircraft startup Lilium — only for the company to cease operations in 2024 after raising more than $1 billion and going public via a SPAC.  In de Vries’ view, Lilium went bankrupt because it couldn’t find the growth capital it needed, but this “traumatizing experience” also had a silver lining. “I saw so many amazing teams in Europe that were going through the same journey,” he said. “[Europe] doesn’t have an innovation problem. It doesn’t have a startup problem. The problem it has is a scale-up problem.” Kembara’s sweet spot will be Series B and C rounds, with plans to write initial checks from €15 million to €40 million into some 20 companies. But the fund’s size leaves room for follow-ons to help portfolio startups scale manufacturing and expand globally, and total investments could go up to €100 million per company.  That’s more than the full size of many European funds, though this may be changing: deep tech VC firm Elaia and asset manager Lazard teamed up to form LEC (Lazard Elaia Capital), whose initial investments will range between €20 million and €60 million per company, while operator-led fund Plural is reportedly raising a new fund of up to €1 billion. Still, the capital-intensive nature of most climate and deep tech growth-stage companies means that even large VC checks can only go so far. One lesson de Vries learned from Lilium is that raising only in equity is very hard, and even puts companies in a hard spot later on. This inspired Kembara to take a different approach to financing. “Several of us have lived through this, and what we want to do now is to productize non-dilutive financing for these deep tech founders to help them de-risk their future financing and optimize the capital structure to minimize dilution. And we’re bringing in [limited partners] who […] not only want to invest in the fund, but also want to coinvest in those winners,” de Vries said.  For these LPs, geopolitics also plays a role in wanting to provide growth capital and venture debt to European growth-stage startups. “There’s going to be a lot of support from sovereign wealth funds in Europe, from government, from corporations, to push and drive for building these European champions in deep tech out of Europe,” de Vries predicted.  These geopolitical undertones are also reflected in Kembara’s sector focus, which includes dual use and defense tech to “protect European sovereignty,” according to a press release. However, de Vries pushed back against the idea that Kembara is simply replacing capital that later-stage European outfits could have raised abroad.  “There are lots of gems that are under the radar in Europe, that could be scaling into global champions, and that are not realizing their full potential.” He said DeepMind is a related example, “where they were missing this growth capital and sold too early.” (Google acquired the company for more than $500 million in 2014, but it is now estimated to be worth billions.) Keeping European companies European has gained urgency in many verticals that overlap with Kembara’s thesis, such as quantum computing, semiconductors, and space tech. But its goal is to foster global champions that cross borders. Coincidentally, Kembara means “to wander” in Malaysian (although the team holds “the humble path to excellence” as an older meaning). Beyond the name, Kembara has Malaysian connections. Santiso is also the former CEO for Europe of Malaysian sovereign wealth fund Khazanah; and doors could open as many countries examine their exposure to the U.S. “In the second close, we’re going to be looking for global investors, because we want to have global access to markets, but also global access to supply chain,” de Vries said. Topics \nFreelance Reporter\n Anna Heim is a writer and editorial consultant. You can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com. As a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends. As of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories. Anna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more. A former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese. Tickets are live at the lowest rates of the year. Save up to $680 on your pass now.Meet investors. Discover your next portfolio company. Hear from 250+ tech leaders, dive into 200+ sessions, and explore 300+ startups building what’s next. Don’t miss these one-time savings.  Homeland Security is trying to force tech companies to hand over data about Trump critics\n  Fintech CEO and Forbes 30 Under 30 alum has been charged for alleged fraud\n  Two Stanford students launch $2M startup accelerator for students nationwide\n  Notepad++ says Chinese government hackers hijacked its software updates for months\n  Meet the new European unicorns of 2026\n  Nvidia CEO pushes back against report that his company’s $100B OpenAI investment has stalled\n  OpenClaw’s AI assistants are now building their own social network\n © 2025 TechCrunch Media LLC.",
        "ingested_at": "2026-02-05T16:42:53.259688"
    },
    {
        "source_url": "https://techcrunch.com/feed/",
        "category_group": "Tech",
        "title": "Stripe alumni raise €30M Series A for Duna, backed by Stripe and Adyen execs",
        "link": "https://techcrunch.com/2026/02/04/stripe-alumni-raise-e30m-series-a-for-duna-backed-by-stripe-and-adyen-execs/",
        "published": "Wed, 04 Feb 2026 23:49:18 +0000",
        "summary_rss": "Having raised a €30 million Series A round led by CapitalG, business identity verification startup Duna is now among the most well-capitalized European startups founded by Stripe alumni.",
        "full_text": "Latest\t\n \n\n\t\tAI\t\n \n\n\t\tAmazon\t\n \n\n\t\tApps\t\n \n\n\t\tBiotech & Health\t\n \n\n\t\tClimate\t\n \n\n\t\tCloud Computing\t\n \n\n\t\tCommerce\t\n \n\n\t\tCrypto\t\n \n\n\t\tEnterprise\t\n \n\n\t\tEVs\t\n \n\n\t\tFintech\t\n \n\n\t\tFundraising\t\n \n\n\t\tGadgets\t\n \n\n\t\tGaming\t\n \n\n\t\tGoogle\t\n \n\n\t\tGovernment & Policy\t\n \n\n\t\tHardware\t\n \n\n\t\tInstagram\t\n \n\n\t\tLayoffs\t\n \n\n\t\tMedia & Entertainment\t\n \n\n\t\tMeta\t\n \n\n\t\tMicrosoft\t\n \n\n\t\tPrivacy\t\n \n\n\t\tRobotics\t\n \n\n\t\tSecurity\t\n \n\n\t\tSocial\t\n \n\n\t\tSpace\t\n \n\n\t\tStartups\t\n \n\n\t\tTikTok\t\n \n\n\t\tTransportation\t\n \n\n\t\tVenture\t\n \n\n\t\tStaff\t\n \n\n\t\tEvents\t\n \n\n\t\tStartup Battlefield\t\n \n\n\t\tStrictlyVC\t\n \n\n\t\tNewsletters\t\n \n\n\t\tPodcasts\t\n \n\n\t\tVideos\t\n \n\n\t\tPartner Content\t\n \n\n\t\tTechCrunch Brand Studio\t\n \n\n\t\tCrunchboard\t\n \n\n\t\tContact Us\t\n Anthropic and OpenAI may be rivals, but their presidents Daniela Amodei and Gregory Brockman have one thing in common: they are both Stripe alumni. With former employees who went on to create dozens of startups, the fintech company has become one of the most prolific “founder factories” — and the money is following. The latest example: business identity verification startup Duna, which just raised a €30 million Series A to become the best-funded European member of the so-called “Stripe mafia.” The funding round was led by Alphabet’s growth fund CapitalG, which has also backed Stripe since co-leading its Series D in 2016. Based in Germany and the Netherlands, Duna was co-founded by Stripe alumni Duco van Lanschot and David Schreiber. With customers including Plaid, the startup helps fintech companies onboard business customers more efficiently, reducing the typical churn associated with corporate ID checks and other fraud prevention measures. Stripe is not a customer of Duna, van Lanschot said, but its executives were well placed to understand the opportunity that the startup is seizing, which is reflected in its cap table. The company’s angel investors include former Stripe executives David Singleton (CTO), Claire Hughes Johnson (COO) and Michael Cocoman (Global Chief Compliance Officer). Even Stripe rival Adyen got involved, with CRCO Mariëtte Swart and CFO Ethan Tandowsky joining as angels. Their endorsements also validate van Lanschot’s hunch that these companies won’t compete with Duna, even though they could. “It requires such fine-grained controls that change on a company-by-company basis, that an Adyen or a Stripe isn’t going to spin out their business onboarding as a separate product where another enterprise customer can change all of the configurations,” he told TechCrunch. If it’s still worth the effort for Duna, it’s because the startup is going after the long tail of enterprise clients that don’t have huge resources to dedicate to business onboarding. But it’s also because its vision doesn’t stop there: Duna’s ambition is to build a network that allows companies to reuse their verified identity information across multiple platforms. “What we want to build over time is a global trust infrastructure where we provide a digital passport for every business. So you can reuse your file from onboarding on [German spend management platform] Moss to onboard with Plaid, or you can reuse it to open up a bank account,” van Lanschot said.  This goal resonated with Alex Nichols, the general partner who led CapitalG’s investment into the Series A. “I would say the common thing I look for in my investments are some sort of network effects, or more formal scale advantage,” he told TechCrunch. “I also love it when founders have an earned insight about a problem they may not know about otherwise, and this is a very good example of that,” he added. Duna has competitors in the category known as KYB, or Know Your Business. This includes vendors such as Jumio and Veriff. But for Nichols, what sets Duna apart is its decision to generate its own data, rather than trying to aggregate existing data sources that are often lacking. “It’s the rare opportunity to rebuild something as foundational as a Visa and create an amazing business in the process.” Duna says it has already found a strong business case in helping customers onboard corporate users faster and cheaper. This also explains why existing investors are doubling down: Index Ventures, which led Duna’s €10.7 million seed round in May 2025, participated in the Series A, as did Puzzle Ventures and Snowflake chairman Frank Slootman. But the startup’s bigger ambition won’t pay off until Duna reaches significant scale. So the company is looking for shortcuts. How so? Van Lanschot and the Duna team are identifying small clusters of companies that already overlap with each other — what they call “patches of networks.” These include manufacturing companies with shared customers, investment firms with overlapping LPs, or companies in the same small country. In these tight-knit groups, the ability to reuse verification becomes valuable immediately, even before Duna achieves full network effects. The countries may be small, but the opportunity is big, van Lanschot said. “In the Netherlands alone — a tiny, tiny country — the four biggest banks employ 14,000 people in compliance, and half of them are working on businesses.” CapitalG later clarified that 13,000 people work on compliance across all Dutch banks. Either way, Duna won’t fully replace these jobs yet, but AI automation can save costs and generate revenue even before the network effects kick in. If Duna eventually provides the rails for an identity network, there might be an even bigger opportunity in taking advantage of this position to enable one-click business onboarding. This would make it akin to Amazon’s one-click checkout — or closer to B2B, to Stripe Link. Once again with Duna, the Stripe connection is never really far. This story was updated to correct the name and title of one of Duna’s angel investors, and to add a clarification on the number of people employed in compliance in the Netherlands. Topics \nFreelance Reporter\n Anna Heim is a writer and editorial consultant. You can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com. As a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends. As of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories. Anna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more. A former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese. Tickets are live at the lowest rates of the year. Save up to $680 on your pass now.Meet investors. Discover your next portfolio company. Hear from 250+ tech leaders, dive into 200+ sessions, and explore 300+ startups building what’s next. Don’t miss these one-time savings.  Homeland Security is trying to force tech companies to hand over data about Trump critics\n  Fintech CEO and Forbes 30 Under 30 alum has been charged for alleged fraud\n  Two Stanford students launch $2M startup accelerator for students nationwide\n  Notepad++ says Chinese government hackers hijacked its software updates for months\n  Meet the new European unicorns of 2026\n  Nvidia CEO pushes back against report that his company’s $100B OpenAI investment has stalled\n  OpenClaw’s AI assistants are now building their own social network\n © 2025 TechCrunch Media LLC.",
        "ingested_at": "2026-02-05T16:42:55.137454"
    },
    {
        "source_url": "https://techcrunch.com/feed/",
        "category_group": "Tech",
        "title": "Alphabet won’t talk about the Google-Apple AI deal, even to investors",
        "link": "https://techcrunch.com/2026/02/04/alphabet-wont-talk-about-the-google-apple-ai-deal-even-to-investors/",
        "published": "Wed, 04 Feb 2026 23:28:31 +0000",
        "summary_rss": "Alphabet CEO skipped an analyst's question about Apple on the company's earnings call.",
        "full_text": "Latest\t\n \n\n\t\tAI\t\n \n\n\t\tAmazon\t\n \n\n\t\tApps\t\n \n\n\t\tBiotech & Health\t\n \n\n\t\tClimate\t\n \n\n\t\tCloud Computing\t\n \n\n\t\tCommerce\t\n \n\n\t\tCrypto\t\n \n\n\t\tEnterprise\t\n \n\n\t\tEVs\t\n \n\n\t\tFintech\t\n \n\n\t\tFundraising\t\n \n\n\t\tGadgets\t\n \n\n\t\tGaming\t\n \n\n\t\tGoogle\t\n \n\n\t\tGovernment & Policy\t\n \n\n\t\tHardware\t\n \n\n\t\tInstagram\t\n \n\n\t\tLayoffs\t\n \n\n\t\tMedia & Entertainment\t\n \n\n\t\tMeta\t\n \n\n\t\tMicrosoft\t\n \n\n\t\tPrivacy\t\n \n\n\t\tRobotics\t\n \n\n\t\tSecurity\t\n \n\n\t\tSocial\t\n \n\n\t\tSpace\t\n \n\n\t\tStartups\t\n \n\n\t\tTikTok\t\n \n\n\t\tTransportation\t\n \n\n\t\tVenture\t\n \n\n\t\tStaff\t\n \n\n\t\tEvents\t\n \n\n\t\tStartup Battlefield\t\n \n\n\t\tStrictlyVC\t\n \n\n\t\tNewsletters\t\n \n\n\t\tPodcasts\t\n \n\n\t\tVideos\t\n \n\n\t\tPartner Content\t\n \n\n\t\tTechCrunch Brand Studio\t\n \n\n\t\tCrunchboard\t\n \n\n\t\tContact Us\t\n Alphabet declined to answer one of its investors during questions about Google’s AI deal with Apple on Wednesday’s fourth-quarter earnings call. Instead of responding to an analyst’s question about how the tech giant is thinking about AI partnerships, such as the one with Apple to power AI for Siri, the question was completely ignored. That decision tells us something, though — Alphabet isn’t ready to talk about how this partnership will impact its core business, which is increasingly focused on AI.  Over the years, the Google-Apple relationship has been mutually beneficial. The two companies’ search partnership saw the search giant paying the iPhone maker $20 billion to be the default search engine on Apple devices, filings from the Department of Justice’s lawsuit against the search giant revealed. In turn, Google gained access to Apple’s massive customer base — the iPhone maker last quarter announced it has 2.5 billion active devices worldwide, to give you an idea of scale. The latest Apple AI deal is rumored to cost Apple roughly $1 billion per year, but the payoff beyond that for Google isn’t as immediately obvious as it is with search. In Google Search, consumers see links to advertisers’ websites at the top of their search results. Ads in AI Mode, which could one day represent the future of Google’s search business, are still an “experiment” for now. The company first announced last May that it would bring ads to AI Mode, the chatbot-style interface for Google Search, but these tests see the ads’ placement below or integrated into the chatbot’s responses. Google is also trying out agentic shopping, including Shop with AI Mode, to guide consumers with product-related queries to a seamless checkout experience from the AI interface.  Meanwhile, Google’s AI competitor Anthropic is taking aim at ad-supported AI with its forthcoming Super Bowl ad, which challenges the business model being adopted by ChatGPT maker OpenAI and Google. How this will all play out longer-term is still an open question — and for today, an unanswered one, apparently.  Overall, the Apple Siri deal barely received any mention during Alphabet’s earnings call on Wednesday. Sundar Pichai only noted he was pleased that Apple’s “preferred cloud provider” and would be helping to develop “the next generation of Apple foundation models based on Gemini technology.” Google’s Chief Business Officer Philipp Schindler used the exact same wording when mentioning Apple, as well. Topics \nConsumer News Editor\n Tickets are live at the lowest rates of the year. Save up to $680 on your pass now.Meet investors. Discover your next portfolio company. Hear from 250+ tech leaders, dive into 200+ sessions, and explore 300+ startups building what’s next. Don’t miss these one-time savings.  Homeland Security is trying to force tech companies to hand over data about Trump critics\n  Fintech CEO and Forbes 30 Under 30 alum has been charged for alleged fraud\n  Two Stanford students launch $2M startup accelerator for students nationwide\n  Notepad++ says Chinese government hackers hijacked its software updates for months\n  Meet the new European unicorns of 2026\n  Nvidia CEO pushes back against report that his company’s $100B OpenAI investment has stalled\n  OpenClaw’s AI assistants are now building their own social network\n © 2025 TechCrunch Media LLC.",
        "ingested_at": "2026-02-05T16:42:56.909693"
    },
    {
        "source_url": "https://www.wired.com/feed/rss",
        "category_group": "Tech",
        "title": "How iPhones Made a Surprising Comeback in China",
        "link": "https://www.wired.com/story/how-iphones-made-a-surprising-comeback-in-china/",
        "published": "Thu, 05 Feb 2026 11:00:00 +0000",
        "summary_rss": "Huawei’s and Xiaomi’s flagship devices are packed with impressive features, but Apple is dominating the Chinese smartphone market again—for now.",
        "full_text": "After a prolonged slump, Apple’s business is suddenly thriving again in China. The tech giant said in its latest earnings report last week that revenue from the country rose 38 percent year over year in the last quarter, primarily driven by surging demand for iPhones. The rebound came after Apple’s China sales had declined for 18 consecutive months between 2024 and early 2025. In a call with analysts, CEO Tim Cook said Apple set a new record for iPhone upgrades among Chinese customers and saw double-digit growth in the number of users switching from other operating systems to iOS. “Overall, a great quarter in China. We could not be happier with it,” Cook concluded in his signature monotone voice. Apple’s fantastic performance came as a surprise to many observers of the Chinese smartphone market. In recent years, homegrown brands like Huawei and Xiaomi have chipped away at Apple’s market share by releasing premium, feature-packed devices that directly compete with the iPhone. Huawei, for instance, stunned the tech industry when it released a $2,800 smartphone with a trifold screen in September 2024, long before competitors put out similar products. The most striking thing about Apple’s comeback in China is how it pulled it off. Instead of trying to compete by developing flashier tech, it simply released a new iPhone that is both powerful and competitively priced, experts tell WIRED. Even though there are devices from local brands that technically have better cameras and more sophisticated artificial intelligence capabilities (Apple Intelligence is not yet available in mainland China), many buyers still opted for Apple’s iPhone 17 line. That suggests Chinese consumers continue to care more about Apple's brand power and design features than marginal technical improvements. “It's a good story if you're Apple. It's the same old story if you're not Apple,” says Gerrit Schneemann, a senior analyst covering Apple at Counterpoint, a global technology research firm. Apple owes much of its success in China last quarter to sales of the baseline iPhone 17 model. Traditionally, consumers who buy iPhones at launch tend to gravitate toward the higher-end Pro and Pro Max devices But in 2025, the baseline iPhone 17 represented a much bigger step up from the iPhone 16 than usual, including features traditionally only associated with the Pro series. That may have motivated more people to upgrade sooner than usual after the new phones came out, Schneemann says. But Apple’s product strategy wasn’t the only important factor here. The iPhone 17 was priced low enough to qualify for a massive electronics subsidy program launched by the Chinese government last year. To help stimulate the economy, Beijing spent some $43 billion subsidizing domestic purchases of electronics, appliances, and cars in 2025. Smartphones sold for less than 6,000 RMB (about $860) were eligible for up to a 15 percent discount. Apple listed the iPhone 17 in China for 5,999 RMB, ensuring price-sensitive buyers would be able to benefit from the government policy. The state subsidy also arrived at a moment when many Chinese iPhone users were likely due for an upgrade anyway. “Apple’s last peak sales period came with the iPhone 13 series, and after a span of three to four years, its existing users have gradually entered the upgrade cycle this year,” says Arthur Guo, a Beijing-based research manager at IDC, a global market analysis firm. None of these explanations indicate that Apple’s Chinese competitors are doing anything wrong. Guo notes that domestic brands have also experienced significant growth recently. Expensive flagship models from brands like Xiaomi, Vivo, and Oppo have “remained strong across the board—with even more notable growth recorded for the higher-priced Pro/Pro Max variants,” Guo says. The only exception is Huawei, which lost out on sales during much of the last quarter after releasing its flagship phone later than usual, at the end of November. Initial supply shortages also limited availability of the device. Huawei is Apple’s most formidable competitor in the high-end Chinese market, and its absence almost certainly contributed to Apple’s win. Apple’s growth in China mirrors its success in other parts of the world. The company’s share of the US smartphone market rose to 69 percent last quarter, a record high, according to a market analysis published by Counterpoint on Monday. As the smartphone industry heads into a potentially tumultuous period caused by a shortage of memory chips, Apple is setting itself up for a smoother 2026 than its rivals. Apple’s recent track record in China offers a bitter lesson for Chinese competitors: Despite all the rhetoric about supporting domestic brands and their increasingly impressive phone models, Chinese shoppers are sticking with Apple. The Chinese tech giants may have folding phones and fancy AI, but all it took for Apple to regain its momentum was to upgrade the iPhone's screen display and make some other relatively small tweaks. “I'm not too sure how somebody like Oppo or Vivo or Xiaomi can break that kind of stranglehold,” says Schneemann.",
        "ingested_at": "2026-02-05T16:42:59.216727"
    },
    {
        "source_url": "https://www.wired.com/feed/rss",
        "category_group": "Tech",
        "title": "Hollywood Is Losing Audiences to AI Fatigue",
        "link": "https://www.wired.com/story/hollywood-is-losing-audiences-to-ai-fatigue/",
        "published": "Thu, 05 Feb 2026 10:30:00 +0000",
        "summary_rss": "Entertainment about or made with artificial intelligence has been missing the mark with viewers over the past year.",
        "full_text": "An insurrectionist robot unleashed by a mad inventor in Fritz Lang’s Metropolis. HAL 9000 sabotaging a manned mission to Jupiter in 2001: A Space Odyssey. Skynet, the self-aware global defense network that seeks to exterminate humanity throughout the Terminator franchise. Hollywood has never wanted for audacious depictions of artificial intelligence or the ways in which it could alter the fate of our species. But the rapid integration of AI into the studio system and our now unavoidable interactions with it have severely compromised the genre, not to mention film as a medium. On the one hand, it’s perfectly understandable that screenwriters and studios would return to the subject of AI in recent years, particularly since it provokes such fierce debate within the industry. (A major cause of the 2023 labor strikes was the threat that AI posed to creative jobs.) Still, the novelty faded fast. Consider M3GAN, a campy horror flick about an artificially intelligent doll who starts killing people, released just a week after the debut of ChatGPT in 2022: It was a surprise box-office smash. Last year’s sequel? A critical and commercial flop. Mission: Impossible—Dead Reckoning (2023) introduced a rogue AI called The Entity as a final adversary for Ethan Hunt and crew. The resolution of its cliff-hanger ending and blockbuster finale for the spy saga, Mission: Impossible—The Final Reckoning (2025), underperformed its predecessor, and neither quite justified their expense. The latest AI-themed bomb is Mercy, a crime thriller starring Chris Pratt as an LAPD detective strapped into a chair who has 90 minutes to pull enough evidence from security cameras and phone records to convince a stern judge bot (Rebecca Ferguson) that he didn’t kill his wife—or else face instant execution. Despite releasing in January, one reviewer has already declared it “the worst movie of 2026,” and judging by its mediocre ticket sales, many US moviegoers decided as much from the trailer alone. It’s almost as if nobody cared whether a fictional software program might be capable of sparing a life when real health insurance claims are being denied by algorithms already. For those few who did see it, Mercy fell far short of its dystopian premise, failing to grapple with the ethics of such a surveillance state and its medieval-modern justice system in favor of cheap relativism. Spoiler: Pratt’s character and the AI ultimately team up to stop the real bad guys as the bot begins to show signs of unrobotic emotion and doubt, which manifest as glitches in the program. By the end, Pratt is delivering a true groaner of a we’re-not-so-different speech to the holographic Ferguson. “Human or AI, we all make mistakes,” he says. “And we learn.” While the naive belief in AI’s progress toward enlightenment feels dated on arrival, you are also reminded of how prophetically cynical something like Paul Verhoeven’s RoboCop, now almost 40 years old, was in addressing a future of cybernetic fascism. Contrary to that kind of pitch-black, violent satire, the current trend seems to be propagandistic narratives about how AIs are scary at first but secretly good. (See also: Tron: Ares, Disney’s wildly misguided attempt to leverage an old IP for the era of large language models, another cinematic train wreck of 2025.) In fact, the insistence on some inborn value or honor to artificial intelligence may be the driving force behind the new Time Studios web series On This Day…1776. Conceived as a blow-by-blow account of the year the American colonies declared independence from the British crown, it consists of short YouTube videos generated in part by Google DeepMind (though actual actors supply voiceovers). The project has drawn serious attention and scorn because acclaimed director Darren Aronofsky served as executive producer via his creative studio Primordial Soup, launched last year in a partnership with Google to explore the applications of AI in filmmaking. It probably doesn’t help that Aronofsky and company are valorizing the country’s founders in the same aesthetic that has defined the authoritarian meme culture of Donald Trump’s second term. The YouTube replies are, to put it lightly, brutal. “If I was a professional director and I released this I would be suicidal,” reads a top-voted comment on the first installment. “Pure dogshit,” another person observed. Time Studios limited engagement to channel subscribers only; some commenters claimed they had subscribed simply to condemn the “slop” they were looking at. In addition to the uncanny faces and dead glossy eyes of the founding fathers, viewers noted constant quick cuts, presumably meant to limit visual errors. Yet, when called upon to render a historic document for a scene, DeepMind rendered the word “America” as “Aamereedd.” Audiences have proven equally hostile to digitally altered versions of existing entertainment. On social media, at least, you won’t find many defenders of a certain nostalgia-baiting Xfinity commercial directed by Taika Waititi and scheduled to air during the Super Bowl this weekend. That’s because it creepily de-ages Jurassic Park stars Sam Neill, Laura Dern, and Jeff Goldblum, all for a sequence of gags about the dinosaur zoo-resort functioning perfectly thanks to a solid Wi-Fi signal. In the grotesque close-ups, they’re barely recognizable. The irony of appropriating a film that was technologically astounding for its time and adding a layer of ugly deepfakery is hard to miss. The ad was also made possible through extreme media and telecom consolidation, as Xfinity is a division of the multinational conglomerate Comcast, which owns NBCUniversal, which owns Jurassic Park as well as NBC, which is broadcasting the Super Bowl. The result is a necrotic ode to brand synergy. Wisely, Xfinity has not allowed any comments whatsoever on the YouTube upload of the commercial, though the reactions elsewhere have not been enthusiastic. “That ‘de-aging’ technology just makes them look like melting wax figures,” wrote a horrified user on X, where breathless hype for visual effects achieved with generative AI is usually plentiful. The entertainment world can’t move as quickly as Silicon Valley startups or the public perception of smart appliances and virtual assistants. Nevertheless, Hollywood could soon notice an AI backlash that hurts its bottom line so long as studios are pushing it as both a half-baked dramatic theme and a transformative tool. However topical movies and television may become, they have long relied on the power of escapism. Will they have answers when we’re ready to be saved from the daily onslaught of bots?",
        "ingested_at": "2026-02-05T16:43:01.029699"
    },
    {
        "source_url": "https://www.wired.com/feed/rss",
        "category_group": "Tech",
        "title": "I Didn't Care for Dildos Until I Tried This One From Lelo",
        "link": "https://www.wired.com/story/i-didnt-care-for-dildos-until-i-tried-this-one-from-lelo/",
        "published": "Thu, 05 Feb 2026 09:00:00 +0000",
        "summary_rss": "Even if you typically don't like dildos, the Lelo Gigi 3 could be your ticket to sexual pleasure.",
        "full_text": "My first sex toy was a bright blue dildo. I was about 19, and as a college student in New Hampshire, I did what anyone in my position would do: hotfooted it to the closest city to find a sex shop. With my best friend in tow, I jetted in and out of the Condom World on Newbury Street so fast that I only had time to grab the first sex toy I saw and pay for it, keeping my head down the whole time. To say the early 2000s were different when it came to sex toy acceptance would be a gross understatement. In my small-town mind, they were something that shouldn’t be discussed and the very definition of the word taboo. But they weren’t taboo enough to keep me from buying that battery-operated blue monstrosity with its exaggerated veins and head. I was embarrassed by it from day one, even more so after I used it, with zero understanding of what I was supposed to get out of it. As I got to know my body better, exploring on my own or during partnered sex, with other toys I purchased, I came to a realization. As much as I love penetration with my partner(s), I didn't particularly enjoy dildos. I found most impersonal, poorly designed, and because it wouldn’t be until my late 30s that I’d finally have an orgasm from G-spot simulation, on a pleasure level, they weren’t for me. This didn’t stop me from trying to get something out of them, especially as I started writing about sexual wellness and suddenly had a world of sex toys and the newest innovations at the tip of my fingers. Lelo Lelo Amazon Nordstrom My feelings on dildos changed drastically with the Lelo Gigi 3. Finally, an internal dildo with a head that was flattened, as opposed to cone-shaped, meaning it covered more of the G-spot area. Breaking news, that's exactly what I needed after all this time. While so many other dildos have rounded heads, which many people love, the flat head of the Gigi 3 is what really sets it apart. It’s not just the shape of the head, but the way it disperses stimulation. Because the eight vibration modes are delivered through the flattened head, the sensations are more intense and rumbly, meaning I can feel them branching out and reaching more nerve endings. People with vulvas are far too often taught that when it comes to sexual pleasure, the focus should be on the clitoris or the G-spot—or both at once—but the reality is that the entire region is chock-full of nerve endings. Hence, the reason people with vulvas can experience orgasms outside these two zones, like via the A-spot (anterior fornix) and the U-spot (urethral sponge). I’m not a size queen. I’m the first to admit that smaller is better when it comes to external vibrators. However, when it comes to internal vibrators, the size and shape of the shaft matter. The Gigi 3 is the ideal size for G-spot stimulation. Even those who have yet to officially find their G-spot can’t possibly miss it when using the Gigi 3 because the length and slight arc of the shaft puts that flattened head exactly where every person with a vulva wants it. For me, I love to put a few drops of water-based lube on the head and shaft of the Gigi 3, get myself comfy, then slide it inside. From there, I can melt into the moment without fumbling with buttons (the Gigi 3 is app-controlled). When I’m not in the mood for internal play, the flat head of the Gigi 3 is great for direct clitoral stimulation or teasing other parts of my vulva. As I’ve learned, just because the labia doesn’t have as many nerve endings as the clitoris doesn’t mean it likes to be ignored. Is the Lelo Gigi 3 my favorite sex toy? No. Depending on the day and my mood, my favorite sex toys and vibrators change. But, if you’re someone with a vulva who has never liked dildos, the Gigi 3 could be your ticket to sexual pleasure. It could also hit the spot if you prefer clitoral stimulation, but want the vibrations to encompass more than just the external tip of the clit. Although the Gigi 3 can be used anywhere, internally and externally, if you have a vulva, this is a must-have.",
        "ingested_at": "2026-02-05T16:43:02.961418"
    },
    {
        "source_url": "https://www.wired.com/feed/rss",
        "category_group": "Tech",
        "title": "Paramount Plus Coupon Codes and Deals: 50% Off",
        "link": "https://www.wired.com/story/paramount-plus-coupon-code/",
        "published": "Thu, 05 Feb 2026 06:10:00 +0000",
        "summary_rss": "Save on streaming with the latest Paramount+ promo codes and deals, including 50% off subscriptions, free trials, and more.",
        "full_text": "Once the most talked-about TV show in the country, South Park, is on Paramount+. Don’t you want to know what got Trump in such a tizzy? Stream the much buzzed-about South Park, fan-favorite Yellowstone, original series MobLand, and rebooted crime drama Dexter & Dexter on Paramount+. The streaming network has a bingeable TV series for almost everyone. And whether you want to remember Lindsay Lohan’s old face in the classic Mean Girls flick, or wonder just how many more sequels Tom Cruise has left in him with Top Gun: Maverick, there’s a bevy of films to stream, too. If you’re like me and have at least half a dozen streaming services, our Paramount+ coupon codes can help you save so you can watch the content you want without having to get rid of one of your other beloved content platforms. (I love pretending the world isn’t full of suffering around me and instead focus on Sylvester Stallone’s ever-changing Play-Doh face in Tulsa King.) If you’re unsure if you’ll actually want to commit to Paramount+, or if there’s a sports event like the Big Game or March Madness games and you only need to access the content for a little while, Paramount+’s free trial is a great option. The trial lasts one week, is for new subscribers only, and can’t be paired with other offers. There are tiered plans, including Essential, which allows for 3 devices, select Showtime series, NFL games, and can be streamed on up to 3 devices at once, but has ads; and Premium, which includes all that except there are no ads, downloadable content, CBS live, and all of Showtime content. It’s important that you choose the right Paramount+ streaming plan for you so that you can get the best bang for your buck. Lucky for you, all plans come with a 7-day free trial so you can make sure you’re choosing the right plan for you. The first is Paramount+ Essential, which is $8 per month. It has ads included, but you’ll have access to over 40,000 episodes and movies. And you’ll be able to stream on 3 devices at once, be able to watch NFL games on CBS and UEFA Champions League, and select Showtime series are also available. Paramount+ Premium is the next tier (and the most popular choice), which starts at $13 per month (after the free trial ends), and you’ll get everything mentioned in the previous tier, without ads. You’ll have all that as well as the ability to watch in 4K UHD, Dolby Vision or HDR10, downloadable movies and shows, streaming CBS live and all of Showtime’s content library. If you find the service isn’t right for you, or just need to cut down on subscriptions, you can cancel Paramount+ any time. However, the cancellation process depends on where you signed up. If you signed up directly on the website, you’ll need to go to your account page. If you’re a student now (or have your student ID lying around somewhere), you can get a Paramount+ plan at only $4 a month. All you have to do is verify your student status and you’ll get 50% off any plan of your choosing for the first year. Or if you’re a military member, Paramount+ gives 50% off any subscription for life. There’s truly something for everyone in the family, with movies, kids’ shows, and Paramount+ originals included in every plan. If you’re feeling spooky, I’d recommend Dexter: Resurrection, or Yellowjackets, but if you’re looking for something more family-friendly, there’s super popular cartoons like Rango or Sonic the Hedgehog to choose from. Looking for specific recommendations? I’ve got you. There are tons of great new releases coming to Paramount+ this month, including Landman season 2, new Paramount+ original comedy series Crutch starring Tracy Morgan, and new episodes of (my favorite) newly premiered Ink Master Season 17. There are also tons of new movies, including The Cut, a boxing drama starring Orlando Bloom, dark comedy Shell, and true-crime tale My Nightmare Stalker: The Eva LaRue Story. Plus, Paramount+ will be playing the important NFL holiday games. Check out the wide breadth of TV and movie content to choose from on Paramount+ (and use the Paramount+ promo codes above to save on whatever plan you decide). For better or worse, I’m a Chiefs fan (cue the booing). I usually get a Paramount+ plan during the football season to keep up with my favorite beefy, TBI-ridden men. You can stream all of the NFL coverage you want all season long, plus, 24/7 live channels are now streaming on Paramount+, so you’ll never need to give your brain the time to process the horrors. Paramount+ has all the man-on-man action you want, from bloody brawls to KO’s. Paramount+ is your one-stop-shop to stream UFC live so you can catch every fight. This includes UFC Fight Night: Bautista vs. Oliveira on February 7, and UFC Fight Night: Strickland vs. Hernandez, airing February 21. The annual tournament that determines which men’s and women’s Division I teams will win the NCAA Basketball championships, March Madness, will be streaming on Paramount+ this spring. You can watch any men's March Madness games that are being broadcast on CBS with Paramount+. Let the games begin! If football (or soccer) is more your jam, Paramount+ also has you covered. You can watch Champions League Soccer at Paramount+, including fan favorites and heated rivalries from Real Madrid, AC Milan, Bayern Munich, Liverpool, Barcelona, and more. With a Paramount+ subscription, you also get so many perks, including tons of CBS content. This means that golf lovers can watch CBS Sports PGA tour, streaming on Paramount+. This includes six signature events and the FedExCup Playoffs. In its 69th consecutive year of broadcasting the PGA TOUR, CBS will also stream games live on Paramount+, including the WM Phoenix Open on February 7 and 8, and The Genesis Invitational on Feb 21 and 22. There’s a game for every golf lover, including coverage of both the PGA tour and The Masters tournament.",
        "ingested_at": "2026-02-05T16:43:04.859075"
    },
    {
        "source_url": "https://www.wired.com/feed/rss",
        "category_group": "Tech",
        "title": "Visible Promo Code: Save Over $400 in February 2026",
        "link": "https://www.wired.com/story/visible-promo-code/",
        "published": "Thu, 05 Feb 2026 06:07:00 +0000",
        "summary_rss": "Find great deals and promo codes for Visible at WIRED and save big, whether you're a long-time customer or a newbie.",
        "full_text": "Visible offers access to Verizon’s network in two unlimited plans for as low as $25 per month, with unlimited data, talk and text using Verizon’s 5G & 4G LTE networks, and unlimited talk and text to Mexico and Canada. Buying a new phone and signing up for a new phone contract can be super overwhelming—with all of the options available, confusing contract terms, and hidden fees making things more complicated. Visible makes it easy to save even more on their already affordable plans, and you can even score a free phone with our Visible promo code. It should be said, for transparency, that such low costs mean that you won’t get some of the perks we’ve come to expect with the bigger tech and cell providers. For the low price of Visible, there’s only minimal customer service via an on-site chat, so if you’re someone who needs a lot of technical support, this may not be the provider for you. There are tons of Visible promo codes available this year, so be sure to check out our coupons above. Some of the best deals we’ve seen are major discounts on various plans, including a code (above) that will help you get Visible+ for $30/month for up to 5 years when you port in from an eligible carrier. And when you join Visible with a Back Market phone, you can save up to $432 over 36 months. Visible makes it easier (and cheaper) than ever to stay connected to your inner circle. Visible’s Inner Circle membership allows you to give or receive payments between the members of your Circle, making it easier than ever to share plans with friends and family. This helps to simplify payments, including set up and managing shared payment responsibilities in one place, while still maintaining privacy on payment details and account control. You can also save $5 per month on Visible+ or Visible+Pro plans by joining an Inner Circle. There are plenty of other great discounts at Visible to help new customers feel confident in their move. Visible also offers a very generous 15-day free trial, where you bring your own phone, get a trial phone number, and try the Visible plan commitment-free for 15 days to see how you like the service before taking the plunge. If you love Visible, you and your friend can save with this referral promo. When you bring a friend to Visible, you each get one $20 service credit when a plan is purchased. Plus, if you have a lot of friends looking for a new phone plan, you can share your Bring a Friend code with up to 12 people at a time (meaning you’ll get 12 credits added to your account).",
        "ingested_at": "2026-02-05T16:43:06.693577"
    },
    {
        "source_url": "https://feeds.feedburner.com/TheHackersNews",
        "category_group": "Tech",
        "title": "Critical n8n Flaw CVE-2026-25049 Enables System Command Execution via Malicious Workflows",
        "link": "https://thehackernews.com/2026/02/critical-n8n-flaw-cve-2026-25049.html",
        "published": "Thu, 05 Feb 2026 11:46:00 +0530",
        "summary_rss": "A new, critical security vulnerability has been disclosed in the n8n workflow automation platform that, if successfully exploited, could result in the execution of arbitrary system commands.\nThe flaw, tracked as CVE-2026-25049 (CVSS score: 9.4), is the result of inadequate sanitization that bypasses safeguards put in place to address CVE-2025-68613 (CVSS score: 9.9), another critical defect that",
        "full_text": "A new, critical security vulnerability has been disclosed in the n8n workflow automation platform that, if successfully exploited, could result in the execution of arbitrary system commands.\nThe flaw, tracked as CVE-2026-25049 (CVSS score: 9.4), is the result of inadequate sanitization that bypasses safeguards put in place to address CVE-2025-68613 (CVSS score: 9.9), another critical defect that",
        "ingested_at": "2026-02-05T16:43:09.626494"
    },
    {
        "source_url": "https://feeds.feedburner.com/TheHackersNews",
        "category_group": "Tech",
        "title": "Malicious NGINX Configurations Enable Large-Scale Web Traffic Hijacking Campaign",
        "link": "https://thehackernews.com/2026/02/hackers-exploit-react2shell-to-hijack.html",
        "published": "Thu, 05 Feb 2026 10:26:00 +0530",
        "summary_rss": "Cybersecurity researchers have disclosed details of an active web traffic hijacking campaign that has targeted NGINX installations and management panels like Baota (BT) in an attempt to route it through the attacker's infrastructure.\nDatadog Security Labs said it observed threat actors associated with the recent React2Shell (CVE-2025-55182, CVSS score: 10.0) exploitation using malicious NGINX",
        "full_text": "Cybersecurity researchers have disclosed details of an active web traffic hijacking campaign that has targeted NGINX installations and management panels like Baota (BT) in an attempt to route it through the attacker's infrastructure.\nDatadog Security Labs said it observed threat actors associated with the recent React2Shell (CVE-2025-55182, CVSS score: 10.0) exploitation using malicious NGINX",
        "ingested_at": "2026-02-05T16:43:11.805790"
    },
    {
        "source_url": "https://feeds.feedburner.com/TheHackersNews",
        "category_group": "Tech",
        "title": "Microsoft Develops Scanner to Detect Backdoors in Open-Weight Large Language Models",
        "link": "https://thehackernews.com/2026/02/microsoft-develops-scanner-to-detect.html",
        "published": "Wed, 04 Feb 2026 23:22:00 +0530",
        "summary_rss": "Microsoft on Wednesday said it built a lightweight scanner that it said can detect backdoors in open-weight large language models (LLMs) and improve the overall trust in artificial intelligence (AI) systems.\nThe tech giant's AI Security team said the scanner leverages three observable signals that can be used to reliably flag the presence of backdoors while maintaining a low false positive",
        "full_text": "Microsoft on Wednesday said it built a lightweight scanner that it said can detect backdoors in open-weight large language models (LLMs) and improve the overall trust in artificial intelligence (AI) systems.\nThe tech giant's AI Security team said the scanner leverages three observable signals that can be used to reliably flag the presence of backdoors while maintaining a low false positive",
        "ingested_at": "2026-02-05T16:43:13.855241"
    },
    {
        "source_url": "https://feeds.feedburner.com/TheHackersNews",
        "category_group": "Tech",
        "title": "DEAD#VAX Malware Campaign Deploys AsyncRAT via IPFS-Hosted VHD Phishing Files",
        "link": "https://thehackernews.com/2026/02/deadvax-malware-campaign-deploys.html",
        "published": "Wed, 04 Feb 2026 22:54:00 +0530",
        "summary_rss": "Threat hunters have disclosed details of a new, stealthy malware campaign dubbed DEAD#VAX that employs a mix of \"disciplined tradecraft and clever abuse of legitimate system features\" to bypass traditional detection mechanisms and deploy a remote access trojan (RAT) known as AsyncRAT.\n\"The attack leverages IPFS-hosted VHD files, extreme script obfuscation, runtime decryption, and in-memory",
        "full_text": "Threat hunters have disclosed details of a new, stealthy malware campaign dubbed DEAD#VAX that employs a mix of \"disciplined tradecraft and clever abuse of legitimate system features\" to bypass traditional detection mechanisms and deploy a remote access trojan (RAT) known as AsyncRAT.\n\"The attack leverages IPFS-hosted VHD files, extreme script obfuscation, runtime decryption, and in-memory",
        "ingested_at": "2026-02-05T16:43:16.218943"
    },
    {
        "source_url": "https://feeds.feedburner.com/TheHackersNews",
        "category_group": "Tech",
        "title": "China-Linked Amaranth-Dragon Exploits WinRAR Flaw in Espionage Campaigns",
        "link": "https://thehackernews.com/2026/02/china-linked-amaranth-dragon-exploits.html",
        "published": "Wed, 04 Feb 2026 19:39:00 +0530",
        "summary_rss": "Threat actors affiliated with China have been attributed to a fresh set of cyber espionage campaigns targeting government and law enforcement agencies across Southeast Asia throughout 2025.\nCheck Point Research is tracking the previously undocumented activity cluster under the moniker Amaranth-Dragon, which it said shares links to the APT 41 ecosystem. Targeted countries include Cambodia,",
        "full_text": "Threat actors affiliated with China have been attributed to a fresh set of cyber espionage campaigns targeting government and law enforcement agencies across Southeast Asia throughout 2025.\nCheck Point Research is tracking the previously undocumented activity cluster under the moniker Amaranth-Dragon, which it said shares links to the APT 41 ecosystem. Targeted countries include Cambodia,",
        "ingested_at": "2026-02-05T16:43:19.306284"
    },
    {
        "source_url": "https://timesofindia.indiatimes.com/rssfeeds/-2128936835.cms",
        "category_group": "India",
        "title": "'PM hiding behind Speaker': Opposition's sharp retort to Lok Sabha Speaker Om Birla's remark on Modi speech, Congress 'plot'",
        "link": "https://timesofindia.indiatimes.com/india/pm-hiding-behind-speaker-oppositions-sharp-retort-to-lok-sabha-speaker-om-birlas-remark-on-modi-speech-congress-plot/articleshow/127930325.cms",
        "published": "2026-02-05T15:53:30+05:30",
        "summary_rss": "<a href=\"https://timesofindia.indiatimes.com/india/pm-hiding-behind-speaker-oppositions-sharp-retort-to-lok-sabha-speaker-om-birlas-remark-on-modi-speech-congress-plot/articleshow/127930325.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/127930325.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>",
        "full_text": "The TOI News Desk comprises a dedicated and tireless team of journalists who operate around the clock to deliver the most current and comprehensive news and updates to the readers of The Times of India worldwide. With an unwavering commitment to excellence in journalism, our team is at the forefront of gathering, verifying, and presenting breaking news, in-depth analysis, and insightful reports on a wide range of topics. The TOI News Desk is your trusted source for staying informed and connected to the ever-evolving global landscape, ensuring that our readers are equipped with the latest developments that matter most.\"Read More",
        "ingested_at": "2026-02-05T16:43:22.701223"
    },
    {
        "source_url": "https://timesofindia.indiatimes.com/rssfeeds/-2128936835.cms",
        "category_group": "India",
        "title": "'Requested PM not to come to House': Lok Sabha Speaker says plot by Congress MPs to create 'inappropriate incident'",
        "link": "https://timesofindia.indiatimes.com/india/requested-pm-not-to-come-to-house-lok-sabha-speaker-says-plot-by-congress-mps-to-create-inappropriate-incident/articleshow/127929244.cms",
        "published": "2026-02-05T15:20:38+05:30",
        "summary_rss": "<a href=\"https://timesofindia.indiatimes.com/india/requested-pm-not-to-come-to-house-lok-sabha-speaker-says-plot-by-congress-mps-to-create-inappropriate-incident/articleshow/127929244.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/127929244.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Lok Sabha was adjourned amid security concerns over alleged Congress plans to attack Prime Minister Narendra Modi, despite his presence. Opposition rejected the claims, accusing the government of stalling proceedings. The Prime Minister is expected to address the Rajya Sabha later.",
        "full_text": "The TOI News Desk comprises a dedicated and tireless team of journalists who operate around the clock to deliver the most current and comprehensive news and updates to the readers of The Times of India worldwide. With an unwavering commitment to excellence in journalism, our team is at the forefront of gathering, verifying, and presenting breaking news, in-depth analysis, and insightful reports on a wide range of topics. The TOI News Desk is your trusted source for staying informed and connected to the ever-evolving global landscape, ensuring that our readers are equipped with the latest developments that matter most.\"Read More",
        "ingested_at": "2026-02-05T16:43:24.597473"
    },
    {
        "source_url": "https://timesofindia.indiatimes.com/rssfeeds/-2128936835.cms",
        "category_group": "India",
        "title": "Indian teacher Rouble Nagi, who painted educational murals across slums, wins Global Teacher Prize",
        "link": "https://timesofindia.indiatimes.com/india/indian-teacher-rouble-nagi-who-painted-educational-murals-across-slums-wins-global-teacher-prize/articleshow/127929551.cms",
        "published": "2026-02-05T15:15:41+05:30",
        "summary_rss": "<a href=\"https://timesofindia.indiatimes.com/india/indian-teacher-rouble-nagi-who-painted-educational-murals-across-slums-wins-global-teacher-prize/articleshow/127929551.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/127929551.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>Indian teacher and activist Rouble Nagi has won the Global Teacher Prize in Dubai for her work establishing over 800 learning centers and creating educational murals in slum areas. Nagi plans to use the $1 million prize to build an institute offering free vocational training to students, continuing her mission to make education accessible.",
        "full_text": "The TOI News Desk comprises a dedicated and tireless team of journalists who operate around the clock to deliver the most current and comprehensive news and updates to the readers of The Times of India worldwide. With an unwavering commitment to excellence in journalism, our team is at the forefront of gathering, verifying, and presenting breaking news, in-depth analysis, and insightful reports on a wide range of topics. The TOI News Desk is your trusted source for staying informed and connected to the ever-evolving global landscape, ensuring that our readers are equipped with the latest developments that matter most.\"Read More",
        "ingested_at": "2026-02-05T16:43:26.648947"
    },
    {
        "source_url": "https://timesofindia.indiatimes.com/rssfeeds/-2128936835.cms",
        "category_group": "India",
        "title": "'No such visit took place': MEA rubbishes report claiming Doval–Rubio meet before India-US trade deal",
        "link": "https://timesofindia.indiatimes.com/india/no-such-visit-took-place-mea-rubbishes-report-claiming-dovalrubio-meet-before-india-us-trade-deal/articleshow/127928981.cms",
        "published": "2026-02-05T14:44:36+05:30",
        "summary_rss": "<a href=\"https://timesofindia.indiatimes.com/india/no-such-visit-took-place-mea-rubbishes-report-claiming-dovalrubio-meet-before-india-us-trade-deal/articleshow/127928981.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/127928981.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>The Ministry of External Affairs has firmly denied a Bloomberg report alleging National Security Adviser Ajit Doval met with US Secretary of State Marco Rubio regarding a trade deal. MEA spokesperson Randhir Jaiswal called the claims baseless, stating no such meeting occurred. This rebuttal follows recent announcements of a trade agreement between India and the US.",
        "full_text": "The TOI News Desk comprises a dedicated and tireless team of journalists who operate around the clock to deliver the most current and comprehensive news and updates to the readers of The Times of India worldwide. With an unwavering commitment to excellence in journalism, our team is at the forefront of gathering, verifying, and presenting breaking news, in-depth analysis, and insightful reports on a wide range of topics. The TOI News Desk is your trusted source for staying informed and connected to the ever-evolving global landscape, ensuring that our readers are equipped with the latest developments that matter most.\"Read More",
        "ingested_at": "2026-02-05T16:43:28.467696"
    },
    {
        "source_url": "https://timesofindia.indiatimes.com/rssfeeds/-2128936835.cms",
        "category_group": "India",
        "title": "'Energy security supreme priority': MEA replies to Trump's claim on Russian, Venezuelan oil; says decisions guided by national interest",
        "link": "https://timesofindia.indiatimes.com/india/energy-security-supreme-priority-mea-replies-to-trumps-claim-on-russian-venezuelan-oil-says-decisions-guided-by-national-interest/articleshow/127928555.cms",
        "published": "2026-02-05T14:33:43+05:30",
        "summary_rss": "<a href=\"https://timesofindia.indiatimes.com/india/energy-security-supreme-priority-mea-replies-to-trumps-claim-on-russian-venezuelan-oil-says-decisions-guided-by-national-interest/articleshow/127928555.cms\"><img align=\"left\" border=\"0\" hspace=\"10\" src=\"https://timesofindia.indiatimes.com/photo/127928555.cms\" style=\"margin-top: 3px; margin-right: 5px;\" /></a>-",
        "full_text": "The TOI News Desk comprises a dedicated and tireless team of journalists who operate around the clock to deliver the most current and comprehensive news and updates to the readers of The Times of India worldwide. With an unwavering commitment to excellence in journalism, our team is at the forefront of gathering, verifying, and presenting breaking news, in-depth analysis, and insightful reports on a wide range of topics. The TOI News Desk is your trusted source for staying informed and connected to the ever-evolving global landscape, ensuring that our readers are equipped with the latest developments that matter most.\"Read More",
        "ingested_at": "2026-02-05T16:43:30.246100"
    },
    {
        "source_url": "https://feeds.feedburner.com/ndtvnews-top-stories",
        "category_group": "India",
        "title": "How Does Bangladesh Vote, How Are Votes Counted: All You Need To Know",
        "link": "https://www.ndtv.com/world-news/elections-2026-how-bangladesh-votes-and-counts-ballots-explained-10945447#publisher=newsstand",
        "published": "Thu, 05 Feb 2026 15:50:59 +0530",
        "summary_rss": "Over 1.2 million Bangladeshis have registered for postal voting",
        "full_text": "Over 1.2 million Bangladeshis have registered for postal voting",
        "ingested_at": "2026-02-05T16:43:33.121898"
    },
    {
        "source_url": "https://feeds.feedburner.com/ndtvnews-top-stories",
        "category_group": "India",
        "title": "\"Congress MPs Might Try Something\": Speaker Says Asked PM To Skip Lok Sabha",
        "link": "https://www.ndtv.com/india-news/parliament-chaos-budget-session-clear-information-congress-planned-attack-on-pm-claim-government-sources-10951273#publisher=newsstand",
        "published": "Thu, 05 Feb 2026 15:41:01 +0530",
        "summary_rss": "Prime Minister Narendra Modi's reply to the Motion of Thanks on the President's address was cancelled in view of an alarm that the Congress had planned a physical attack on him, government sources said.",
        "full_text": "Prime Minister Narendra Modi's reply to the Motion of Thanks on the President's address was cancelled in view of an alarm that the Congress had planned a physical attack on him, government sources said.",
        "ingested_at": "2026-02-05T16:43:34.664215"
    },
    {
        "source_url": "https://feeds.feedburner.com/ndtvnews-top-stories",
        "category_group": "India",
        "title": "First Came Gmail, And Now Jmail - A Peek Into Jeffrey Epstein's Inbox",
        "link": "https://www.ndtv.com/world-news/first-came-gmail-and-now-jmail-a-peek-into-jeffrey-epsteins-inbox-10951505#publisher=newsstand",
        "published": "Thu, 05 Feb 2026 15:40:27 +0530",
        "summary_rss": "In Jmail, the inbox lets users click through thousands of emails",
        "full_text": "In Jmail, the inbox lets users click through thousands of emails",
        "ingested_at": "2026-02-05T16:43:36.302902"
    },
    {
        "source_url": "https://feeds.feedburner.com/ndtvnews-top-stories",
        "category_group": "India",
        "title": "Parliament Budget Session Day 4 Live: Speaker Says He Asked PM To Skip Lok Sabha Amid Safety Concerns",
        "link": "https://www.ndtv.com/india-news/parliament-budget-session-live-updates-bjp-congress-pm-modi-rahul-gandhi-parliament-lok-sabha-rajya-sabha-10949488#publisher=newsstand",
        "published": "Thu, 05 Feb 2026 15:23:53 +0530",
        "summary_rss": "Budget session of Parliament Live: The Lok Sabha witnessed repeated adjournments on Wednesday.",
        "full_text": "Budget session of Parliament Live: The Lok Sabha witnessed repeated adjournments on Wednesday.",
        "ingested_at": "2026-02-05T16:43:37.998378"
    },
    {
        "source_url": "https://feeds.feedburner.com/ndtvnews-top-stories",
        "category_group": "India",
        "title": "Opinion: Blog | The Descent Of Man (And MP) - By Shashi Tharoor",
        "link": "https://www.ndtv.com/opinion/the-descent-of-man-and-mp-10951275#publisher=newsstand",
        "published": "Thu, 05 Feb 2026 15:20:14 +0530",
        "summary_rss": "\"Having spent decades navigating the slippery slopes of policy and the treacherous inclines of debate, it was, quite ironically, a simple marble step that proved to be my undoing.\"",
        "full_text": "\"Having spent decades navigating the slippery slopes of policy and the treacherous inclines of debate, it was, quite ironically, a simple marble step that proved to be my undoing.\"",
        "ingested_at": "2026-02-05T16:43:39.555619"
    },
    {
        "source_url": "https://www.thehindu.com/news/national/feeder/default.rss",
        "category_group": "India",
        "title": "Anurag Thakur free to participate in BCCI affairs, SC says; modifies 2017 order",
        "link": "https://www.thehindu.com/news/national/anurag-thakur-free-to-participate-in-bcci-affairs-sc-says-modifies-2017-order/article70595420.ece",
        "published": "Thu, 05 Feb 2026 16:34:10 +0530",
        "summary_rss": "On January 2, 2027, the court had directed Mr. Thakur to “forthwith cease and desist from being associated with the working of BCCI”",
        "full_text": "February 5, 2026e-Paper \n\t\t\t\t\t\t\t\t\tThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\n \n\t\t\t\t\t\t\t\t\tFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\n \n\t\t\t\t\t\t\t\t\tToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\n \n\t\t\t\t\t\t\t\t\tScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\n \n\t\t\t\t\t\t\t\t\tData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\n \n\t\t\t\t\t\t\t\t\tHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\n \n\t\t\t\t\t\t\t\t\tThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\n February 5, 2026e-Paper  Published - February 05, 2026 04:34 pm IST - Delhi \n                    BJP MP Anurag Thakur, speaks in Lok Sabha.\n                                          | Photo Credit: ANI\n                                       The Supreme Court on Thursday (February 5, 2026) modified its 2017 order in a major relief for former BCCI president and current BJP Lok Sabha MP Anurag Thakur and said he shall be free to participate in the affairs of the cricket board according to rules and regulations. On January 2, 2027, the court had directed Mr. Thakur to “forthwith cease and desist from being associated with the working of BCCI”. A Bench headed by Chief Justice of India Surya Kant said Mr. Thakur was “hitherto free to participate in the affairs of the BCCI as per the rules and regulations”.  The court had passed the ‘cease-and-desist’ direction against Mr. Thakur for failure to implement the Justice Lodha Committee reforms in the BCCI.  The Bench of Chief Justice Kant and Justice Joymalya Bagchi on Thursday (February 5) lifted the embargo on Mr. Thakur considering the fact that he had given an unconditional apology and he has been unconnected with the BCCI for nine years now.  Published - February 05, 2026 04:34 pm IST \n                        Supreme Court\n                    \n                            /                      \n                        \n                        cricket\n                     \n\t\t\t\t\tCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\n\t\t\t\t BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.  We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "ingested_at": "2026-02-05T16:43:41.491945"
    },
    {
        "source_url": "https://www.thehindu.com/news/national/feeder/default.rss",
        "category_group": "India",
        "title": "Janardhan Reddy hits back at YSRCP for its protest over RLIS",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/janardhan-reddy-hits-back-at-ysrcp-for-its-protest-over-rlis/article70595343.ece",
        "published": "Thu, 05 Feb 2026 16:33:54 +0530",
        "summary_rss": "The Minister said that Mr. Jagan Mohan Reddy did not even spend ₹2 lakh crore for Rayalaseema even as ₹12 lakh crore was allocated in the Budget during his tenure",
        "full_text": "February 5, 2026e-Paper \n\t\t\t\t\t\t\t\t\tThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\n \n\t\t\t\t\t\t\t\t\tFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\n \n\t\t\t\t\t\t\t\t\tToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\n \n\t\t\t\t\t\t\t\t\tScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\n \n\t\t\t\t\t\t\t\t\tData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\n \n\t\t\t\t\t\t\t\t\tHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\n \n\t\t\t\t\t\t\t\t\tThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\n February 5, 2026e-Paper  Published - February 05, 2026 04:33 pm IST - NANDYAL Minister for Roads and Buildings B.C. Janardhan Reddy lashed out at the YSR Congress Party (YSRCP) for neglecting the Rayalaseema region when it was in power and now making a hue and cry over the Rayalaseema Lift Irrigation Scheme, the construction of which was stopped during the YSRCP regime. Reacting to the YSRCP holding Chalo Pothireddypadu protest in Nandyal district on Thursday (February 05), Mr. Janardhan Reddy questioned as to why the former chief minister Y S Jagan Mohan Reddy maintained silence when the Rayalaseema lift works were halted by the National Green Tribunal in 2020 itself. Mr. Jagan Mohan Reddy even failed to file a counter in the subsequent four years, he said and alleged that the YSRCP president is trying to instigate regional feelings with his protests. The Minister said that Mr. Jagan Mohan Reddy did not even spend ₹2 lakh crore for Rayalaseema even as ₹12 lakh crore was allocated in the Budget during his tenure. “Mr. Jagan Mohan Reddy had scrapped the drip irrigation project that would have benefitted the region. He had pre-closed 102 projects in Rayalaseema region. I dare Mr. Jagan Mohan Reddy for a debate on development of Rayalaseema,” Mr. Janardhan Reddy said. The Minister said the previous TDP government had started 13 pumps of Muchumarri project in 2017 itself but Mr. Jagan Mohan Reddy did not take forward the project fearing that the credit would go to the TDP and Chief Minister N. Chandrababu Naidu. “Mr. Chandrababu Naidu has turned drought-prone Anantapur into a horticulture hub and had spent ₹8,000 crore in just 19 months. Development works to the tune of ₹5,000 crore are taking place in Orvakal and Kopparthi,” Mr. Janardhan Reddy added. Further, investments to the tune of ₹4.5 lakh crore are coming up in Rayalaseema which will provide jobs to the youth of the region. Stating that Mr. Jagan Mohan Reddy has no moral right to speak about development of Rayalaseema, the Minister said they are ready for a debate on the issue on the floor of State Assembly and asked the YSRCP chief to participate in the same with his 11 MLAs.  Published - February 05, 2026 04:33 pm IST \n\t\t\t\t\tCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\n\t\t\t\t BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.  We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "ingested_at": "2026-02-05T16:43:43.107071"
    },
    {
        "source_url": "https://www.thehindu.com/news/national/feeder/default.rss",
        "category_group": "India",
        "title": "Tamil Nadu CM Stalin inaugurates projects across State",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/tamil-nadu-cm-stalin-inaugurates-projects-across-state/article70595056.ece",
        "published": "Thu, 05 Feb 2026 16:31:49 +0530",
        "summary_rss": "",
        "full_text": "February 5, 2026e-Paper \n\t\t\t\t\t\t\t\t\tThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\n \n\t\t\t\t\t\t\t\t\tFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\n \n\t\t\t\t\t\t\t\t\tToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\n \n\t\t\t\t\t\t\t\t\tScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\n \n\t\t\t\t\t\t\t\t\tData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\n \n\t\t\t\t\t\t\t\t\tHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\n \n\t\t\t\t\t\t\t\t\tThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\n February 5, 2026e-Paper  Published - February 05, 2026 04:31 pm IST - CHENNAI \n                    Tamil Nadu Chief Minister M.K. Stalin virtually inaugurates various projects across the State, from the Secretariat in Chennai on February 5, 2026\n                                          | Photo Credit: Special Arrangement\n                                       Tamil Nadu Chief Minister M.K. Stalin, on Thursday (February 5, 2026), virtually inaugurated 183 projects completed by the Municipal Administration and Water Supply Department in various locations across the State at a total cost of ₹3,511 crore. He also unveiled the foundation for 10 projects that are scheduled to be implemented at a total cost of ₹1,267 crore. The completed projects include integrated drinking waters in Chengalpattu, Kanniyakumari, Namakkal, Thoothukudi, Tirupattur and Tiruvallur districts, drainage projects in Greater Chennai Corporation and Coimbatore Corporation and various civic infrastructure in Hosur, Namakkal and Thanjavur Corporations, an official release said. In another event at Kalaivanar Arangam in Chennai, the Chief Minister handed over various awards to craft persons and artisans, who have excelled in their respective fields. He handed over ‘Living Craft Treasure’ awards to 10 best craft persons and Poompuhar State Awards to 10 best artisans. C. Kulunthan, N. Rajendran, K. Rethinam, S. Gopal, C. Indhira, K. Subramaniam, T. Thirumoorthy, K. Balraj, S.S. Sangeetham and K. Subramanian received the ‘Living Craft Treasure’ awards for 2025-26 from Mr. Stalin, an official release said. The award carries a cheque for ₹1 lakh, a thamirapattiram, an eight gram gold medal and a certificate. The Chief Minister also inaugurated a handicraft exhibition at Kalaivanar Arangam. Mr. Stalin handed over the Poompuhar State Awards to K. Venkatesh, C. Sangeetha, A. Babu, K. Reeta, M. Shabana, S. Murugan, A. Raj, A. Gavvabeevi, T. Celine Mary and M. Kumar for 2025-26. It carries a cash prize of ₹50,000, a four gram gold medal, a tamirapathiram and a certificate. Ministers K.N. Nehru, E.V. Velu, T.M. Anbarasan, M.P. Saminathan, Ma. Subramanian, P.K. Sekarbabu; Chennai Mayor R. Priya and senior officials participated.  In the Secretariat, the Chief Minister handed over enhanced government grant of ₹36 crore towards administration and maintenance cost of temples in Kanniyakumari, Pudukottai and Thanjavur Devasthanams. He also handed over government grants to the tune of ₹1.17 crore for the Muktinath pilgrimage of 389 pilgrims. Mr. Stalin virtually inaugurated various projects for Tamil Nadu Cooperative Milk Producers’ Federation Limited that have been implemented at a total cost of ₹100 crore. Ministers P.K. Sekarbabu, T. Mano Thangaraj; Chief Secretary N. Muruganandam and senior officials participated.   Published - February 05, 2026 04:31 pm IST \n\t\t\t\t\tCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\n\t\t\t\t BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.  We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "ingested_at": "2026-02-05T16:43:44.699486"
    },
    {
        "source_url": "https://www.thehindu.com/news/national/feeder/default.rss",
        "category_group": "India",
        "title": "YSRCP indulges in hate politics: Kondru Muralimohan",
        "link": "https://www.thehindu.com/news/national/andhra-pradesh/ysrcp-indulges-in-hate-politics-kondru-muralimohan/article70594546.ece",
        "published": "Thu, 05 Feb 2026 16:29:43 +0530",
        "summary_rss": "He said that Opposition party was trying to divert the attention of the people with regard to use of adulterated ghee for the preparation of Tirupati laddu",
        "full_text": "February 5, 2026e-Paper \n\t\t\t\t\t\t\t\t\tThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\n \n\t\t\t\t\t\t\t\t\tFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\n \n\t\t\t\t\t\t\t\t\tToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\n \n\t\t\t\t\t\t\t\t\tScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\n \n\t\t\t\t\t\t\t\t\tData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\n \n\t\t\t\t\t\t\t\t\tHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\n \n\t\t\t\t\t\t\t\t\tThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\n February 5, 2026e-Paper  Published - February 05, 2026 04:29 pm IST - VIZIANAGARAM \n                    Kondru Muralimohan. Photo: Special Arrangement\n                                       Former Minister and Rajam MLA Kondru Muralimohan on Thursday (February 5, 2026) alleged that YSR Congress Party is indulging in hate politics as it is unable to digest the growing popularity of the Chandrababu Naidu-led NDA government.  He said that Opposition party was trying to divert the attention of the people with regard to use of adulterated ghee for the preparation of Laddu prasadam of Tirumala.  He distributed CM relief fund cheques to beneficiaries in Rajam of Vizianagaram district. Speaking to media on the occasion, he said the Telugu Desam Party had never crossed its limits and adopted only clean politics in spite of ups and downs in its political journey.  He asked the Opposition party MLAs to attend ensuring Assembly session and raise the public issues instead of adopting hate politics in the State. Mr. Muralimohan would not believe the Opposition party in future as it had completely lost the confidence of the people.   Published - February 05, 2026 04:29 pm IST \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Vijayawada\n                    \n                            /                      \n                        \n                        Visakhapatnam\n                    \n                            /                      \n                        \n                        state politics\n                    \n                            /                      \n                        \n                        politics (general)\n                     \n\t\t\t\t\tCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\n\t\t\t\t BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.  We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "ingested_at": "2026-02-05T16:43:46.332101"
    },
    {
        "source_url": "https://www.thehindu.com/news/national/feeder/default.rss",
        "category_group": "India",
        "title": "CBFC says it cannot certify movies that undermine social harmony",
        "link": "https://www.thehindu.com/news/national/tamil-nadu/cbfc-says-it-cannot-certify-movies-that-undermine-social-harmony/article70595084.ece",
        "published": "Thu, 05 Feb 2026 16:27:15 +0530",
        "summary_rss": "It files a counter affidavit before the Madras High Court defending its decision to deny certification to Lakshmi-Lawrence Kadhal",
        "full_text": "February 5, 2026e-Paper \n\t\t\t\t\t\t\t\t\tThe View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective.\n \n\t\t\t\t\t\t\t\t\tFirst Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming.\n \n\t\t\t\t\t\t\t\t\tToday's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day.\n \n\t\t\t\t\t\t\t\t\tScience For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\n \n\t\t\t\t\t\t\t\t\tData Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers\n \n\t\t\t\t\t\t\t\t\tHealth Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there\n \n\t\t\t\t\t\t\t\t\tThe Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features.\n February 5, 2026e-Paper Updated  - February 05, 2026 04:41 pm IST - CHENNAI \n                    A poster of the Tamil movie ‘Lakshmi-Lawrence Kadhal’\n                                          | Photo Credit: Special Arrangement\n                                       When a movie, as a whole, persistently portrays a particular section of society in a derogatory and prejudicial manner and when such narratives are bound to disrupt public order and undermine social harmony, it could be denied certification in toto for public exhibition, the Central Board of Film Certification (CBFC) has contended before the Madras High Court. Filing a counter affidavit in response to an appeal filed by Youreka Cinema School, which had produced the movie Lakshmi-Lawrence Kadhal, CBFC Chennai Regional Officer D. Balamurali said, the board certifies films, including promos and trailers, for public exhibition in theatres and television channels in accordance with the Cinematograph Act, 1952 and Cinematograph (Certification) Rules, 2024. He said, Section 5B(2) of the 1952 Act empowers the Centre to issue such directions as it may think fit, setting out the principles which shall guide the CBFC in sanctioning films for public exhibition. In exercise of such power, the Centre had issued elaborate guidelines to assist the members of the examining committees and revising committees in arriving at a decision. ‘Jana Nayagan’ censor row: Can’t reveal anything, says CBFC Regional Officer Madras High Court lauds Tamil movie Manushi, orders issue of censor certificate after necessary cuts The CBFC was duty bound to ensure visuals or words contemptuous of racial, religious or other groups or which promote communal, obscurantist, anti-scientific and anti-national attitude were not presented in a movie. It was also the duty of the board to ensure public order does not get endangered because of the screening of a movie for public exhibition. Accordingly, both the five member examining committee as well as a nine member revising committee had unanimously decided Lakshmi-Lawrence Kadhal was not fit for certification because “it portrays its interpretation of various belief systems in their adaption of modern science, rituals based on beliefs, treatment of women and downtrodden and caste-based discrimination and consistently portrays one belief system in bad light and the other one as emancipating.”  The counter affidavit also stated “the refusal of certification is not founded upon any stray or isolated scene or dialogue, but upon the cumulative effect of the film viewed in its entirety. The film, as a whole, persistently portrays a particular section of society in a derogatory and prejudicial manner. The potential for incitement of disharmony and social unrest is not speculative but imminent and real.” Mr. Balamurali went on to state: “Such narratives are bound to disrupt public order and undermine social harmony. The contents capable of provoking communal disharmony or widespread social unrest cannot be cloaked under the guise of freedom of expression.” After the counter affidavit filed by CBFC counsel K.R. Samratt was served upon the producer’s counsel M. Santhanaraman, the judge adjourned the hearing to February 11.  Published - February 05, 2026 04:26 pm IST \n                        Tamil cinema\n                     \n\t\t\t\t\tCopyright© 2026, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\n\t\t\t\t BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments.  We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "ingested_at": "2026-02-05T16:43:48.036852"
    },
    {
        "source_url": "https://www.autocarindia.com/RSS/rss.ashx",
        "category_group": "Auto",
        "title": "2026 Kia Seltos waiting period revealed",
        "link": "https://www.autocarindia.com/car-news/2026-kia-seltos-waiting-period-revealed-438980",
        "published": "2026-02-05T16:10:48+05:30",
        "summary_rss": "<div class=\"ArticleImage\" style=\"text-align: center;\"><img alt=\"2026 Kia Seltos waiting period revealed\" id=\"article_title_img\" src=\"https://asset.autocarindia.com/static/news/images/20260205_094647_5748fd5f.jpg\" /></div><p>The <a href=\"https://www.autocarindia.com/cars/kia/seltos\">2026 Kia Seltos</a> was <a href=\"https://www.autocarindia.com/car-news/new-kia-seltos-launched-at-rs-1099-lakh-438710\">launched</a> in India on January 2, 2026, with prices starting from Rs 10.99 lakh. The new Seltos has already piqued public interest, as <a href=\"https://www.autocarindia.com/cars/kia\">Kia</a> has sold 10,639 units of the mid-size SUV in January 2026, which has resulted in the Seltos nameplate crossing a cumulative sales milestone of 6 lakh units. If you are interested in the Seltos, here’s how much you will need to wait for its delivery.</p><ol><li class=\"ck-list-marker-bold\"><strong>Diesel version has a longer waiting period than the petrol options</strong></li><li class=\"ck-list-marker-bold\"><strong>There is no waiting period difference between transmissions</strong></li><li class=\"ck-list-marker-bold\"><strong>White and black exterior colours have the shortest waiting period</strong></li></ol><h2>2026 Kia Seltos waiting period details</h2><h3>Waiting period differs according to engine, colour option</h3><p>According to our dealer sources, demand for the Kia Seltos’ diesel engine is higher, resulting in a longer waiting period of 6-8 weeks compared to 4-6 weeks waiting for the naturally aspirated petrol and turbo-petrol options. Notably, the waiting period is dependent only on the engine and not on the transmission option of the Seltos.</p><p>The 2026 Kia Seltos is offered in seven trims: HTE, HTE (O), HTK, HTK (O), HTX, GTX and X-Line, and the waiting period for all the trims is dependent on the chosen engine option.</p><div class=\"container-bg-af\" contenteditable=\"false\" style=\"background-color: #f9fafb; border-radius: 8px; border: 1px solid #e5e7eb; display: block; overflow: hidden;\"><div class=\"div-before-after-slider before-after-slider\" style=\"background-color: #f3f4f6; display: flex; width: 100%;\"><figure class=\"image\"><img alt=\"2026 Kia Seltos Glacier White Pearl colour\" class=\"before-image-element bf-image\" src=\"https://asset.autocarindia.com/static/news/images/20260205_095312_233f0d80.jpg?w=735&amp;h=415&amp;q=85\" style=\"display: block; height: 100%; width: 100%;\" title=\"2026 Kia Seltos Glacier White Pearl colour\" /></figure><figure class=\"image\"><img alt=\"2026 Kia Seltos Aurora Black Pearl colour\" class=\"after-image-element bf-image\" src=\"https://asset.autocarindia.com/static/news/images/20260205_095317_c86c4616.jpg?w=735&amp;h=415&amp;q=85\" style=\"display: block; height: 100%; width: 100%;\" title=\"2026 Kia Seltos Aurora Black Pearl colour\" /></figure><div class=\"div-resizer resizer\">&nbsp;</div></div><p style=\"text-align: center;\"><em style=\"background-color: #fff; border-top: 1px solid #e5e7eb; color: #6b7280; display: block; font-size: 14px; margin: 0; padding: 12px;\"><i>2026 Seltos' Glacier White Pearl and Aurora Black Pearl colours</i></em></p></div><p>The dealer sources have also suggested that the Glacier White Pearl and Aurora Black Pearl colours have the least waiting period of up to 6 weeks, while Pewter Olive, Imperial Blue and Magma Red options have a waiting period of up to 8 weeks. Other <a href=\"https://www.autocarindia.com/auto-images/2026-kia-seltos-colour-options-gallery-439853\">colour options </a>on the Seltos include Morning Haze, Frost Blue, Ivory Silver Gloss, Gravity Gray and Xclusive Matte, which have a waiting period of over 6 weeks.</p><p>The new Seltos comes with a 115hp 1.5-litre naturally aspirated engine, a 160hp 1.5-litre turbo-petrol engine and a 116hp 1.5-litre diesel engine, all of which are offered with both manual and automatic gearbox options.</p><p>The 2026 Kia Seltos is priced from Rs 10.99 lakh to Rs 19.99 lakh, and it locks horns with popular mid-size SUVs like the <a href=\"https://www.autocarindia.com/cars/hyundai/creta\">Hyundai Creta</a>, <a href=\"https://www.autocarindia.com/cars/tata/sierra\">Tata Sierra</a>, <a href=\"https://www.autocarindia.com/cars/maruti-suzuki/victoris\">Maruti Suzuki Victoris</a>, <a href=\"https://www.autocarindia.com/cars/toyota/urban-cruiser-hyryder\">Toyota Hyryder</a>, <a href=\"https://www.autocarindia.com/cars/skoda/kushaq-facelift\">Skoda Kushaq</a> and <a href=\"https://www.autocarindia.com/cars/honda/elevate\">Honda Elevate</a>.&nbsp;</p><p><i>All prices are ex-showroom, India.</i></p>",
        "full_text": "Image credits: Ashish Car Review on YouTube The 2026 Kia Seltos was launched in India on January 2, 2026, with prices starting from Rs 10.99 lakh. The new Seltos has already piqued public interest, as Kia has sold 10,639 units of the mid-size SUV in January 2026, which has resulted in the Seltos nameplate crossing a cumulative sales milestone of 6 lakh units. If you are interested in the Seltos, here’s how much you will need to wait for its delivery. According to our dealer sources, demand for the Kia Seltos’ diesel engine is higher, resulting in a longer waiting period of 6-8 weeks compared to 4-6 weeks waiting for the naturally aspirated petrol and turbo-petrol options. Notably, the waiting period is dependent only on the engine and not on the transmission option of the Seltos. The 2026 Kia Seltos is offered in seven trims: HTE, HTE (O), HTK, HTK (O), HTX, GTX and X-Line, and the waiting period for all the trims is dependent on the chosen engine option. 2026 Seltos' Glacier White Pearl and Aurora Black Pearl colours The dealer sources have also suggested that the Glacier White Pearl and Aurora Black Pearl colours have the least waiting period of up to 6 weeks, while Pewter Olive, Imperial Blue and Magma Red options have a waiting period of up to 8 weeks. Other colour options on the Seltos include Morning Haze, Frost Blue, Ivory Silver Gloss, Gravity Gray and Xclusive Matte, which have a waiting period of over 6 weeks. The new Seltos comes with a 115hp 1.5-litre naturally aspirated engine, a 160hp 1.5-litre turbo-petrol engine and a 116hp 1.5-litre diesel engine, all of which are offered with both manual and automatic gearbox options. The 2026 Kia Seltos is priced from Rs 10.99 lakh to Rs 19.99 lakh, and it locks horns with popular mid-size SUVs like the Hyundai Creta, Tata Sierra, Maruti Suzuki Victoris, Toyota Hyryder, Skoda Kushaq and Honda Elevate.  All prices are ex-showroom, India. Kia Seltos ₹12.79 - ₹23.64 Lakh ₹18,502/month Starting EMI ₹18,502/month MG Astor ₹10.92 - ₹17.59 Lakh ₹15,767/month Starting EMI Hyundai Creta ₹12.56 - ₹23.82 Lakh ₹18,181/month Starting EMI Honda Elevate ₹13.49 - ₹19.21 Lakh ₹19,468/month Starting EMI Maruti Suzuki Grand Vitara ₹12.54 - ₹22.66 Lakh ₹18,181/month Starting EMI Skoda Kushaq ₹12.42 - ₹21.42 Lakh ₹18,020/month Starting EMI ₹15,767/month ₹18,181/month ₹19,468/month ₹18,181/month ₹18,020/month Image credits: Rushlane Image credit: Technical SHT via YouTube. Image credits: Sunil Autocar on YouTube",
        "ingested_at": "2026-02-05T16:43:50.588246"
    },
    {
        "source_url": "https://www.autocarindia.com/RSS/rss.ashx",
        "category_group": "Auto",
        "title": "Hyundai i20 entry-price reduced with new Era trim at Rs 5.99 lakh",
        "link": "https://www.autocarindia.com/car-news/hyundai-i20-now-priced-from-rs-599-lakh-438981",
        "published": "2026-02-05T16:07:24+05:30",
        "summary_rss": "<div class=\"ArticleImage\" style=\"text-align: center;\"><img alt=\"Hyundai i20 entry-price reduced with new Era trim at Rs 5.99 lakh\" id=\"article_title_img\" src=\"https://asset.autocarindia.com/static/news/images/20260205_103541_2bfed228.jpeg\" /></div><p></p><p><a href=\"https://www.autocarindia.com/cars/hyundai\">Hyundai</a> has refreshed the <a href=\"https://www.autocarindia.com/cars/hyundai/i20\">i20</a> hatchback trim lineup by bringing back the ‘Era’ trim. Moreover, the carmaker has revised prices for the mid-level Magna Executive and Magna trims. The starting price of the i20 is now more affordable by about Rs 74,000 with the reintroduction of the Era trim.&nbsp;</p><ol><li class=\"ck-list-marker-bold\"><strong>i20 Magna and Magna Executive receive a Rs 13,000 price cut.</strong></li><li class=\"ck-list-marker-bold\"><strong>10.1-inch infotainment system available as dealer-level fitment for additional Rs 15,000</strong></li></ol><h2>Hyundai i20 new trim details&nbsp;</h2><h3>Magna Executive and Magna trims priced from Rs 6.86 lakh and Rs 7.12 lakh respectively&nbsp;</h3><div align=\"left\" dir=\"ltr\" style=\"margin-left: 0pt;\"><figure class=\"table\" style=\"width: 468pt;\"><table style=\"border-collapse: collapse; border-style: none;\"><tbody><tr style=\"height: 0pt;\"><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Hyundai i20 trim&nbsp;</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Old price (Rs, lakh)</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">New price (Rs, lakh)</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Difference (Rs)</span></span></p></td></tr><tr style=\"height: 0pt;\"><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Era MT</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">-</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">5.99</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">New trim</span></span></p></td></tr><tr style=\"height: 0pt;\"><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Magna Executive MT</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">6.86&nbsp;</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">6.73</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">-13,000</span></span></p></td></tr><tr style=\"height: 0pt;\"><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Magna MT</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">7.12</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">6.99</span></span></p></td><td style=\"border-color: #000000; border-width: 1pt; overflow: hidden; padding: 5pt; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.2; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"background-color: transparent; color: #000000; font-size: 11pt;\"><span style=\"font-family: Arial,sans-serif; font-style: normal; font-variant: normal; font-weight: 400; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">-13,000</span></span></p></td></tr></tbody></table></figure></div><p>The i20 base Era trim is priced from Rs 5.99 lakh. Prices for the Magna Executive and Magna trims of the i20 have been slashed by Rs 13,000. For an additional Rs 15,000, Hyundai is offering a 10.1-inch touchscreen infotainment system with wireless Apple CarPlay and Android Auto, along with a rear-view camera as dealer-level fitment backed by a 3-year warranty.</p><p>The Era trim features six airbags, a digital instrument cluster, front and rear skid plates, body coloured ORVMs and door handles, type-C port, and telescopic steering adjustment. No features have been added for the already existing Magna Executive and Magna trims, however.&nbsp;</p><p>Powering the Hyundai i20 is a sole 1.2-litre petrol engine producing 83hp (88hp with CVT) and 115Nm of torque. The engine can be paired with either a 5-speed manual or a CVT gearbox. The i20 goes against the likes of the&nbsp;<a href=\"https://www.autocarindia.com/cars/maruti-suzuki/baleno\">Maruti Baleno</a>,&nbsp;<a href=\"https://www.autocarindia.com/cars/toyota/glanza\">Toyota Glanza</a>, and&nbsp;<a href=\"https://www.autocarindia.com/cars/tata/altroz\">Tata Altroz</a>.</p><p><i>All prices ex-showroom, India.&nbsp;&nbsp;</i></p>",
        "full_text": "Hyundai has refreshed the i20 hatchback trim lineup by bringing back the ‘Era’ trim. Moreover, the carmaker has revised prices for the mid-level Magna Executive and Magna trims. The starting price of the i20 is now more affordable by about Rs 74,000 with the reintroduction of the Era trim.  Hyundai i20 trim  Old price (Rs, lakh) New price (Rs, lakh) Difference (Rs) Era MT - 5.99 New trim Magna Executive MT 6.86  6.73 -13,000 Magna MT 7.12 6.99 -13,000 The i20 base Era trim is priced from Rs 5.99 lakh. Prices for the Magna Executive and Magna trims of the i20 have been slashed by Rs 13,000. For an additional Rs 15,000, Hyundai is offering a 10.1-inch touchscreen infotainment system with wireless Apple CarPlay and Android Auto, along with a rear-view camera as dealer-level fitment backed by a 3-year warranty. The Era trim features six airbags, a digital instrument cluster, front and rear skid plates, body coloured ORVMs and door handles, type-C port, and telescopic steering adjustment. No features have been added for the already existing Magna Executive and Magna trims, however.  Powering the Hyundai i20 is a sole 1.2-litre petrol engine producing 83hp (88hp with CVT) and 115Nm of torque. The engine can be paired with either a 5-speed manual or a CVT gearbox. The i20 goes against the likes of the Maruti Baleno, Toyota Glanza, and Tata Altroz. All prices ex-showroom, India.   Hyundai i20 ₹6.66 - ₹13.41 Lakh ₹9,653/month Starting EMI ₹9,653/month Tata Altroz ₹7.18 - ₹12.24 Lakh ₹10,458/month Starting EMI Maruti Suzuki Baleno ₹6.65 - ₹10.30 Lakh ₹9,653/month Starting EMI Toyota Glanza ₹7.28 - ₹10.44 Lakh ₹10,619/month Starting EMI ₹10,458/month ₹9,653/month ₹10,619/month Image credits: Rushlane Image credit: Technical SHT via YouTube. Image credits: Sunil Autocar on YouTube",
        "ingested_at": "2026-02-05T16:43:52.492017"
    },
    {
        "source_url": "https://www.autocarindia.com/RSS/rss.ashx",
        "category_group": "Auto",
        "title": "Nissan Tekton spied with new exterior and interior details",
        "link": "https://www.autocarindia.com/car-news/nissan-tekton-spied-revealing-new-exterior-and-interior-details-438979",
        "published": "2026-02-05T15:51:21+05:30",
        "summary_rss": "<div class=\"ArticleImage\" style=\"text-align: center;\"><img alt=\"Nissan Tekton spied with new exterior and interior details\" id=\"article_title_img\" src=\"https://asset.autocarindia.com/static/news/images/20260205_093849_d102b77c.jpg\" /></div><p><a href=\"https://www.autocarindia.com/cars/nissan\">Nissan’s</a> upcoming midsize SUV, the <a href=\"https://www.autocarindia.com/cars/nissan/tekton\">Tekton</a>, has been spied testing again in India, giving us the first-ever glimpse of its interior. The model will mark Nissan’s return to the midsize SUV space. While the latest test mule is heavily camouflaged, proportions suggest a conventional upright SUV stance with a long wheelbase and short overhangs. The vehicle seen here appears to be riding on large 18-inch alloy wheels with 225-section tyres.&nbsp;</p><p>The Tekton is a badge-engineered version of the new Duster, just as the <a href=\"https://www.autocarindia.com/car-reviews/new-2013-nissan-terrano-review-test-drive-357283\">Nissan Terrano</a> was based on the old Duster. The Tekton will feature <a href=\"https://www.autocarindia.com/car-news/nissan-tekton-partially-revealed-before-mid-2026-launch-437615\">different design</a> elements inspired by larger Nissan models while remaining mechanically identical to the <a href=\"https://www.autocarindia.com/cars/renault/duster\">Duster.</a></p><ol><li class=\"ck-list-marker-bold\"><strong>Tekton to sit above Magnite in Nissan’s India line-up</strong></li><li class=\"ck-list-marker-bold\"><strong>Expected to launch with turbo-petrol engines, hybrid likely to follow</strong></li><li class=\"ck-list-marker-bold\"><strong>Styling and cabin theme to be distinct from its Renault sibling</strong></li></ol><h2>Nissan Tekton: Exterior design</h2><figure class=\"image\"><img height=\"795\" src=\"https://asset.autocarindia.com/static/editor/images/20260205_093808_e3ebd639.jpg\" width=\"1200\" /></figure><p>Despite concealed body panels, some design cues are visible through the camouflage. The Tekton is expected to feature a Nissan-specific front fascia rather than mirroring its Renault counterpart. The lighting signature appears to include slim, wide-set daytime running lamps and a conventional lighting setup with a full-width LED strip.</p><p>The side profile looks relatively clean, with less pronounced body cladding. At the rear, the tail-lamp area appears to be horizontally oriented, and a wide tailgate surface can be made out, though light graphics remain hidden.</p><figure class=\"image\"><img height=\"795\" src=\"https://asset.autocarindia.com/static/editor/images/20260205_091232_32e504e9.jpg\" width=\"1200\" /></figure><p>Overall, the Tekton is likely to follow the brand’s global SUV design language, inspired by the Nissan Patrol sold overseas, while differentiating itself clearly from its platform sibling.</p><h2>Nissan Tekton: Interior and features</h2><figure class=\"image\"><img height=\"795\" src=\"https://asset.autocarindia.com/static/editor/images/20260205_091244_8f0107d5.jpg\" width=\"1200\" /><figcaption>Image credits:91 Wheels</figcaption></figure><p>The first interior spy shots of the Tekton reveal a flat-bottom steering wheel, steering-mounted controls and a digital instrument cluster. Tekton is expected to feature its own dashboard design, colour schemes and trim finishes to give it a cabin identity distinct from the Duster.</p><p>Expected features could include a large touchscreen infotainment system, a panoramic sunroof, ventilated front seats, a 360-degree camera and an ADAS suite.</p><h2>Nissan Tekton: Engine and powertrain options</h2><figure class=\"image\"><img height=\"2484\" src=\"https://asset.autocarindia.com/static/editor/images/20260205_093836_f8c1d002.jpg\" width=\"3750\" /></figure><p>While Nissan is yet to confirm the engine details for the India-spec Tekton, it is expected to share its core architecture with the new-generation Duster. This suggests that the Tekton could be offered with a 1.3-litre turbo-petrol engine that produces 163hp and 280Nm, paired with a 6-speed manual or a 6-speed DCT, as well as a 1.0-litre turbo-petrol putting out 100hp and 160Nm, offered with a 6-speed manual gearbox only.</p><p>Hybrid technology is also expected, as Renault has confirmed that the new Duster will get a strong hybrid powertrain, which pairs a 109hp 1.8-litre four-cylinder petrol engine with a 49hp electric motor and a 20hp hybrid starter generator (HSG), backed by a 1.4kWh (280 V) battery. Renault is likely to introduce it in India by Diwali 2026.</p><p>The Tekton is expected to be positioned as Nissan’s main offering in the midsize SUV segment, competing with models such as the <a href=\"https://www.autocarindia.com/cars/hyundai/creta\">Hyundai Creta</a>, <a href=\"https://www.autocarindia.com/cars/kia/seltos\">Kia Seltos</a>, <a href=\"https://www.autocarindia.com/cars/honda/elevate\">Honda Elevate</a>, <a href=\"https://www.autocarindia.com/cars/mg/astor\">MG Astor</a>, <a href=\"https://www.autocarindia.com/cars/volkswagen/taigun\">Volkswagen Taigun</a>, <a href=\"https://www.autocarindia.com/cars/skoda/kushaq\">Skoda Kushaq</a>, <a href=\"https://www.autocarindia.com/cars/maruti-suzuki/grand-vitara\">Maruti Grand Vitara</a>, <a href=\"https://www.autocarindia.com/cars/toyota/urban-cruiser-hyryder\">Toyota Hyryder</a>, <a href=\"https://www.autocarindia.com/cars/maruti-suzuki/victoris\">Maruti Victoris</a>, <a href=\"https://www.autocarindia.com/cars/tata/sierra\">Tata Sierra</a> and <a href=\"https://www.autocarindia.com/cars/tata/curvv\">Tata Curvv</a>. Nissan had earlier indicated an unveiling on February 4, but it has been delayed. An official launch timeline has not yet been announced.</p>",
        "full_text": "Image credits: Rushlane Nissan’s upcoming midsize SUV, the Tekton, has been spied testing again in India, giving us the first-ever glimpse of its interior. The model will mark Nissan’s return to the midsize SUV space. While the latest test mule is heavily camouflaged, proportions suggest a conventional upright SUV stance with a long wheelbase and short overhangs. The vehicle seen here appears to be riding on large 18-inch alloy wheels with 225-section tyres.  The Tekton is a badge-engineered version of the new Duster, just as the Nissan Terrano was based on the old Duster. The Tekton will feature different design elements inspired by larger Nissan models while remaining mechanically identical to the Duster. Despite concealed body panels, some design cues are visible through the camouflage. The Tekton is expected to feature a Nissan-specific front fascia rather than mirroring its Renault counterpart. The lighting signature appears to include slim, wide-set daytime running lamps and a conventional lighting setup with a full-width LED strip. The side profile looks relatively clean, with less pronounced body cladding. At the rear, the tail-lamp area appears to be horizontally oriented, and a wide tailgate surface can be made out, though light graphics remain hidden. Overall, the Tekton is likely to follow the brand’s global SUV design language, inspired by the Nissan Patrol sold overseas, while differentiating itself clearly from its platform sibling. The first interior spy shots of the Tekton reveal a flat-bottom steering wheel, steering-mounted controls and a digital instrument cluster. Tekton is expected to feature its own dashboard design, colour schemes and trim finishes to give it a cabin identity distinct from the Duster. Expected features could include a large touchscreen infotainment system, a panoramic sunroof, ventilated front seats, a 360-degree camera and an ADAS suite. While Nissan is yet to confirm the engine details for the India-spec Tekton, it is expected to share its core architecture with the new-generation Duster. This suggests that the Tekton could be offered with a 1.3-litre turbo-petrol engine that produces 163hp and 280Nm, paired with a 6-speed manual or a 6-speed DCT, as well as a 1.0-litre turbo-petrol putting out 100hp and 160Nm, offered with a 6-speed manual gearbox only. Hybrid technology is also expected, as Renault has confirmed that the new Duster will get a strong hybrid powertrain, which pairs a 109hp 1.8-litre four-cylinder petrol engine with a 49hp electric motor and a 20hp hybrid starter generator (HSG), backed by a 1.4kWh (280 V) battery. Renault is likely to introduce it in India by Diwali 2026. The Tekton is expected to be positioned as Nissan’s main offering in the midsize SUV segment, competing with models such as the Hyundai Creta, Kia Seltos, Honda Elevate, MG Astor, Volkswagen Taigun, Skoda Kushaq, Maruti Grand Vitara, Toyota Hyryder, Maruti Victoris, Tata Sierra and Tata Curvv. Nissan had earlier indicated an unveiling on February 4, but it has been delayed. An official launch timeline has not yet been announced. 2026 Renault Duster unveiled in India Mahindra issues statement on the BE 6 fire incident Image credit: Technical SHT via YouTube. Image credits: Sunil Autocar on YouTube BYD Sealion 7 (image used for representation only).",
        "ingested_at": "2026-02-05T16:43:54.121372"
    },
    {
        "source_url": "https://www.autocarindia.com/RSS/rss.ashx",
        "category_group": "Auto",
        "title": "Honda Shine 125 Limited Edition image gallery",
        "link": "https://www.autocarindia.com/auto-images/honda-shine-125-limited-edition-image-gallery-440065",
        "published": "2026-02-05T13:44:22+05:30",
        "summary_rss": "<div class=\"ArticleImage\" style=\"text-align: center;\"><img alt=\"Honda Shine 125 Limited Edition image gallery\" id=\"article_title_img\" src=\"https://asset.autocarindia.com/static/image-galleries/images/20260205_080742_69592f90.jpg\" /></div><p>Honda has launched a Shine 125 Limited Edition at a slight premium over the Disc variant it's based on. For the added price, you get a Pearl Siren Blue colour scheme with revised 'Shine' graphics on the tank and pyrite brown-painted alloy wheels. Mechanically, it remains identical to the standard Shine 125, powered by the same 124cc engine producing 10.6hp and 11Nm.&nbsp;</p>",
        "full_text": "The Honda Shine 125 Limited Edition is based on the existing Disc variant, and adds cosmetic changes.  Like the standard model, it gets an idle start-stop system. The fully digital instrument cluster has been carried over as well.  The brown-coloured alloy wheels are exclusive to the Limited Edition.  The new 'Shine' graphics on the tank differentiate it from the standard bike that's also available in this blue colourway.  It gets a 15W USB-C charging port.  Honda has launched a Shine 125 Limited Edition at a slight premium over the Disc variant it's based on. For the added price, you get a Pearl Siren Blue colour scheme with revised 'Shine' graphics on the tank and pyrite brown-painted alloy wheels. Mechanically, it remains identical to the standard Shine 125, powered by the same 124cc engine producing 10.6hp and 11Nm.  ₹88.20 - 97.40 Thousand ₹1,287/month Starting EMI ₹1,287/month Starting EMI",
        "ingested_at": "2026-02-05T16:43:55.794650"
    },
    {
        "source_url": "https://www.autocarindia.com/RSS/rss.ashx",
        "category_group": "Auto",
        "title": "Tata Harrier, Safari diesel variants get benefits of up to Rs 45,000 in February",
        "link": "https://www.autocarindia.com/car-news/tata-harrier-safari-diesel-variants-get-benefits-of-up-to-rs-45000-in-february-438977",
        "published": "2026-02-05T13:33:29+05:30",
        "summary_rss": "<div class=\"ArticleImage\" style=\"text-align: center;\"><img alt=\"Tata Harrier, Safari diesel variants get benefits of up to Rs 45,000 in February\" id=\"article_title_img\" src=\"https://asset.autocarindia.com/static/news/images/20260205_064442_ff83f8e2.png\" /></div><p><a href=\"https://www.autocarindia.com/cars/tata\">Tata Motors</a> is offering benefits ranging from Rs 25,000 to Rs 45,000 on seven cars this month. These include Tata Harrier, Safari, Nexon, Altroz, Tiago, Tigor and Curvv, all from the model year 2026. Prospective buyers can take advantage of cash discounts and exchange/scrappage benefits on a new Tata car this month, though the loyalty bonus available in January has been withdrawn.&nbsp;</p><p><i><strong>Disclaimer:</strong> Discounts vary from city to city and are subject to stock availability. Please check with your local dealer for exact figures.</i></p><h2>Tata Harrier and Safari offers in February 2026</h2><h3>Up to Rs 45,000</h3><p>Diesel variants of the <a href=\"https://www.autocarindia.com/cars/tata/harrier\">Tata Harrier</a> and Safari SUVs can be purchased with benefits of up to Rs 45,000, including a Rs 10,000 cash discount, which can be clubbed with either a Rs 25,000 exchange or a Rs 35,000 scrappage offer. These benefits are available on the Harrier’s Smart, Pure X, Adventure X, Adventure X+, Fearless X and Fearless X+ variants and the <a href=\"https://www.autocarindia.com/cars/tata/safari\">Tata Safari</a>’s Smart, Pure X, Adventure X+, Accomplished X, Accomplished X+ and Accomplished X+ 6-seater variants.</p><p>The diesel-powered Harrier range is priced between Rs 14 lakh and Rs 25.25 lakh, while the Safari line-up starts at Rs 14.66 lakh and climbs up to Rs 25.96 lakh. There are no discounts on the recently launched petrol variants of the two models.</p><h2>Tata Curvv offers in February 2026</h2><h3>Up to Rs 45,000</h3><figure class=\"image\"><img alt=\"Tata Harrier, Safari get discounts of up to Rs 75,000 in January 2026\" height=\"540\" src=\"https://asset.autocarindia.com/static/editor/images/20260109_113355_8cf5e203.png\" width=\"811\" /></figure><p>Like the Harrier and Safari, the <a href=\"https://www.autocarindia.com/cars/tata/curvv\">Tata Curvv</a> is on sale with total benefits of up to Rs 45,000. However, the cash discount on the coupe-SUV is higher at Rs 20,000, and the exchange and scrappage offers amount to Rs 20,000 and Rs 25,000, respectively. Tata is giving these benefits across Curvv variants, which are priced from Rs 9.66 lakh to Rs 18.85 lakh.</p><h2>Tata Altroz offers in February 2026</h2><h3>Up to Rs 35,000</h3><p>Next, the <a href=\"https://www.autocarindia.com/cars/tata/altroz\">Tata Altroz</a> gets benefits of up to Rs 35,000, including a Rs 15,000 cash discount, along with an exchange (Rs 15,000) or scrappage (Rs 20,000) benefit. These offers are on Smart, Pure, Creative and Accomplished variants of the Altroz, which is priced between Rs 6.3 lakh and Rs 10.51 lakh.</p><h2>Tata Nexon offers in February 2026</h2><h3>Up to Rs 30,000</h3><figure class=\"image\"><img alt=\"Tata Harrier, Safari get discounts of up to Rs 75,000 in January 2026\" height=\"1724\" src=\"https://asset.autocarindia.com/static/editor/images/20260109_105840_25152bfd.JPG\" width=\"2587\" /></figure><p>The <a href=\"https://www.autocarindia.com/cars/tata/nexon\">Tata Nexon</a>, one of the carmaker’s top-selling models, is available with a flat Rs 10,000 discount, coupled with a Rs 15,000 exchange or Rs 20,000 scrappage bonus, taking the total benefits up to Rs 30,000. As with the Curvv, these offers apply to all variants of the Nexon compact SUV. The Nexon line-up is priced from Rs 8 lakh to Rs 14.15 lakh.</p><h2>Tata Tiago and Tigor discounts in February 2026</h2><h3>Up to Rs 30,000</h3><p>Tata is offering cash discounts of Rs 10,000 and Rs 15,000, respectively, on the Tiago and Tigor models, along with a Rs 10,000 exchange or a Rs 15,000 scrappage offer. While all variants of the <a href=\"https://www.autocarindia.com/cars/tata/tigor\">Tata Tigor</a> sedan can be purchased with these offers (fleet line-up excluded), in the <a href=\"https://www.autocarindia.com/cars/tata/tiago\">Tata Tiago</a>’s case, they are applicable to all but the range-starting XE variant. The Tiago is priced from Rs 4.57 lakh to Rs 7.82 lakh, while the Tigor costs Rs 5.49 lakh to Rs 8.74 lakh.</p><p><i>All prices are ex-showroom, India.</i></p><p><strong>Source:</strong> Vahan Warta.</p>",
        "full_text": "Image credit: Technical SHT via YouTube. Tata Motors is offering benefits ranging from Rs 25,000 to Rs 45,000 on seven cars this month. These include Tata Harrier, Safari, Nexon, Altroz, Tiago, Tigor and Curvv, all from the model year 2026. Prospective buyers can take advantage of cash discounts and exchange/scrappage benefits on a new Tata car this month, though the loyalty bonus available in January has been withdrawn.  Disclaimer: Discounts vary from city to city and are subject to stock availability. Please check with your local dealer for exact figures. Diesel variants of the Tata Harrier and Safari SUVs can be purchased with benefits of up to Rs 45,000, including a Rs 10,000 cash discount, which can be clubbed with either a Rs 25,000 exchange or a Rs 35,000 scrappage offer. These benefits are available on the Harrier’s Smart, Pure X, Adventure X, Adventure X+, Fearless X and Fearless X+ variants and the Tata Safari’s Smart, Pure X, Adventure X+, Accomplished X, Accomplished X+ and Accomplished X+ 6-seater variants. The diesel-powered Harrier range is priced between Rs 14 lakh and Rs 25.25 lakh, while the Safari line-up starts at Rs 14.66 lakh and climbs up to Rs 25.96 lakh. There are no discounts on the recently launched petrol variants of the two models. Like the Harrier and Safari, the Tata Curvv is on sale with total benefits of up to Rs 45,000. However, the cash discount on the coupe-SUV is higher at Rs 20,000, and the exchange and scrappage offers amount to Rs 20,000 and Rs 25,000, respectively. Tata is giving these benefits across Curvv variants, which are priced from Rs 9.66 lakh to Rs 18.85 lakh. Next, the Tata Altroz gets benefits of up to Rs 35,000, including a Rs 15,000 cash discount, along with an exchange (Rs 15,000) or scrappage (Rs 20,000) benefit. These offers are on Smart, Pure, Creative and Accomplished variants of the Altroz, which is priced between Rs 6.3 lakh and Rs 10.51 lakh. The Tata Nexon, one of the carmaker’s top-selling models, is available with a flat Rs 10,000 discount, coupled with a Rs 15,000 exchange or Rs 20,000 scrappage bonus, taking the total benefits up to Rs 30,000. As with the Curvv, these offers apply to all variants of the Nexon compact SUV. The Nexon line-up is priced from Rs 8 lakh to Rs 14.15 lakh. Tata is offering cash discounts of Rs 10,000 and Rs 15,000, respectively, on the Tiago and Tigor models, along with a Rs 10,000 exchange or a Rs 15,000 scrappage offer. While all variants of the Tata Tigor sedan can be purchased with these offers (fleet line-up excluded), in the Tata Tiago’s case, they are applicable to all but the range-starting XE variant. The Tiago is priced from Rs 4.57 lakh to Rs 7.82 lakh, while the Tigor costs Rs 5.49 lakh to Rs 8.74 lakh. All prices are ex-showroom, India. Source: Vahan Warta. Tata Harrier ₹14.98 - ₹29.95 Lakh ₹21,720/month Starting EMI Tata Safari ₹15.44 - ₹30.79 Lakh ₹22,364/month Starting EMI ₹21,720/month ₹22,364/month Jeep Compass ₹20.99 - ₹35.85 Lakh ₹30,408/month Starting EMI MG Hector ₹13.94 - ₹27.81 Lakh ₹20,272/month Starting EMI Mahindra XUV700 ₹15.86 - ₹27.97 Lakh ₹23,007/month Starting EMI ₹30,408/month ₹20,272/month ₹23,007/month Image credits: Sunil Autocar on YouTube BYD Sealion 7 (image used for representation only).",
        "ingested_at": "2026-02-05T16:43:57.389643"
    },
    {
        "source_url": "https://www.motor1.com/rss/news/all/",
        "category_group": "Auto",
        "title": "Nissan Dealer Hypes 'Radical-Looking' New Xterra",
        "link": "https://www.motor1.com/news/786448/nissan-dealer-hypes-new-xterra-radical-looking/",
        "published": "Thu, 05 Feb 2026 11:08:24 +0000",
        "summary_rss": "The nameplate returns in the second half of 2028.",
        "full_text": "Selling cars in today’s fiercely competitive market isn’t easy, but the job does come with perks. Automakers typically gain access to new products years ahead of launch, giving them plenty of time to prepare for the arrival of fresh metal. Such is the case for Nissan dealers, who have been allowed an early look at the revival of a long-awaited nameplate: the Xterra. This week in Las Vegas, Nissan showed the new Xterra behind closed doors during a North American Automotive Dealer Show (NADA) meeting. Automotive News cites Scott Smith, president of the Smith Automotive Group near Atlanta, saying the hotly anticipated SUV will be worth the wait. The two-row off-roader is described as “radical-looking,” with design cues inspired by the original model but modernized for the late 2020s. The resurrected Xterra is expected to ride on a newly developed body-on-frame platform, with a design that has “an aggression to it,” according to Charlie Hicks, CEO of Hicks Automotive Group in Texas. Those who have seen it say Nissan is aiming for a rugged look, featuring a beefy grille and an overall emphasis on toughness. The third-generation Xterra is slated to launch in the second half of 2028 and should cost less than $40,000, according to the company’s Senior Vice President Michael Soutter. AN reports the brawny, go-anywhere vehicle won’t arrive alone, as a more luxurious Infiniti counterpart is also planned, presumably with a higher price tag. Nissan has a busy agenda ahead, since the new architecture is also expected to underpin the next Pathfinder, Frontier, and QX60. All of these models are said to offer “electrified” powertrains, meaning hybrid and/or plug-in hybrid options. Meanwhile, the next-generation Rogue should break cover later this year and reach the market in 2027. While the NADA meeting mostly revolved around SUVs and trucks, one car was also mentioned by Nissan. Dealers learned the seven-year-old Altima is getting a stay of execution, but the midsize sedan will inevitably bow out at the end of summer 2027. There’s no mention of a successor, leaving the new Sentra as the sole surviving car following the recent axing of the entry-level Versa. Motor1's Take: A new Xterra can’t come soon enough, as rugged SUVs remain all the rage in North America. Reviving a once-popular nameplate and leaning into off-road capability with a two-speed transfer case (including low range) should appeal to buyers seeking alternatives to the Toyota 4Runner. The Infiniti version, however, may face an unexpected rival by the time it reaches the market. BMW is reportedly plotting its own rugged SUV to lure buyers away from the Mercedes G-Class and Land Rover Defender. The Xterra Is Coming Back: \n                                    Source:\n                                    \n                                                                            Automotive News  \n\n\n\nWe want your opinion!\n What would you like to see on Motor1.com? - The Motor1.com Team Popular latest articles RECOMMENDED FOR YOU Man Works On Nissan Altima While Woman Is At Work. The Problem? He’s A Stranger And Didn’t Ask: 'Happened To Me At Walgreens!' 'Altima-Level Driving’: Woman Takes Escalade For A Spin. Then She Makes Wrong Turn–And Everyone Tells Her To Get A Camry Instead Nissan Won't Build A New Sentra Nismo—So Someone Else Did Volkswagen Injects GTI Hot Hatch Attitude Into A Van We Asked Every Automaker How Many Customers Went For Manuals In 2025 The Weird Audi A2 Is Coming Back, But Not As You Know It The Nissan Z Is Already Getting A Facelift",
        "ingested_at": "2026-02-05T16:43:59.594121"
    },
    {
        "source_url": "https://www.motor1.com/rss/news/all/",
        "category_group": "Auto",
        "title": "Volkswagen Injects GTI Hot Hatch Attitude Into A Van",
        "link": "https://www.motor1.com/news/786437/vw-van-gti-hot-hatch-accents/",
        "published": "Thu, 05 Feb 2026 08:49:50 +0000",
        "summary_rss": "The Transporter gets a new flagship version with strong GTI vibes.",
        "full_text": "Ford may have a long history of selling sporty-looking vans in Europe, but Volkswagen Commercial Vehicles now wants a piece of that action as well. To make it happen, it’s giving the Transporter a new range-topping trim that channels a GTI vibe into a genuinely attractive hauler. With no real business case for a performance-oriented van, however, the Sportline is all show, with no extra go. Since we mentioned Ford, it’s worth remembering that the latest Transporter is largely based on the Transit Custom. In this new GTI-esque configuration, it receives a beefy body kit available in several flavors. While the images show the five-seat Kombi version, customers can also opt for the panel van. Both body styles are offered in short- and long-wheelbase configurations. Beyond its meaner styling, this spicy Transporter stands out with exclusive 19-inch wheels that ditch the usual VW logos in favor of Sportline branding. It also gets a lowered sports suspension with Eibach springs, dropping the ride height by 1.1 inches (29 millimeters). The most daring feature is found at the rear, where a split roof spoiler makes it clear this isn’t your typical workhorse. Up front, the grille’s red accent stripe looks lifted straight from the Polo GTI or Golf GTI. If you’d rather have a true GTI model that hasn’t been sold before, the ID.2 Polo GTI is coming later this year, albeit without a combustion engine. As the flagship version, the Sportline comes loaded as standard. VW includes everything from matrix LED headlights and roof rails to a heated steering wheel and illuminated metal door sill plates. The GTI-like red finish is contrasted by glossy black accents, including the electrically adjustable, heated mirrors. Mind you, this isn’t the first time the Transporter has received the Sportline treatment. VW gave the previous-generation T6.1 a more aggressive makeover a few years ago. As with its predecessor, the newcomer leaves the drivetrains untouched. Whether buyers choose diesel, plug-in hybrid, or fully electric power, there’s no extra grunt over a regular model. Motor1's Take: Vans aren’t supposed to be sporty, but they certainly look more appealing when impersonating a GTI. The Transporter Sportline serves as an alternative to the mechanically related Ford Transit Custom vans modified by MS-RT and sold directly through Ford Pro. Europeans are spoiled for choice when it comes to vans that look fast but actually aren’t. Stellantis, for example, is well versed in this niche, offering the Citroën Dispatch VTR, Opel Vivaro GS, Fiat Scudo Onyx, and Peugeot Expert Sport. Renault’s Trafic Extra Sport is more subtle, but it, too, tries to inject some excitement into the typically dull van segment. VW Van Life: \n                                    Source:\n                                    \n                                                                            Volkswagen Commercial Vehicles  \n\n\n\nWe want your opinion!\n What would you like to see on Motor1.com? - The Motor1.com Team Popular latest articles RECOMMENDED FOR YOU Volkswagen Commits Long-Term To Gasoline Hot Hatches Nissan Dealer Hypes 'Radical-Looking' New Xterra The Volkswagen ID.4 Might Get A New Name: ID. Tiguan 'Altima-Level Driving’: Woman Takes Escalade For A Spin. Then She Makes Wrong Turn–And Everyone Tells Her To Get A Camry Instead When Volkswagen Got Weird: The Three-Wheeler With Gullwing Doors The Weird Audi A2 Is Coming Back, But Not As You Know It The VW ID. Buzz Had A Buzzing Year As Global Sales Doubled In 2025",
        "ingested_at": "2026-02-05T16:44:02.650178"
    },
    {
        "source_url": "https://www.motor1.com/rss/news/all/",
        "category_group": "Auto",
        "title": "The Weird Audi A2 Is Coming Back, But Not As You Know It",
        "link": "https://www.motor1.com/news/786430/new-audi-a2-incoming/",
        "published": "Thu, 05 Feb 2026 07:39:58 +0000",
        "summary_rss": "The spirit of the quirky hatchback will be revived for a new entry-level EV.",
        "full_text": "Audi is gearing up for a busy 2026, with multiple product launches locked in for the remainder of the year. While enthusiasts are eagerly awaiting the new RS5, the SUV-loving crowd has its eyes on the next-generation Q7 and the first-ever Q9. At the other end of the lineup, Ingolstadt is set to shake things up by both adding and subtracting models. Long confirmed to bow out after the current generation, the A1 supermini is expected to retire by year’s end. The subcompact hatchback will likely exit the lineup alongside its crossover sibling, the Q2. Indirectly replacing both models will be a completely different newcomer, reviving a moniker last used about two decades ago: A2. While the original A2 was far from a commercial success due to its high price and quirky styling, Audi hopes its spiritual successor will fare better. The German luxury brand has already confirmed plans to introduce an entry-level EV in 2026, and senior sources within the company have told Autocar it will carry the A2 designation. Our exclusive rendering draws on recent spy shots of a camouflaged prototype undergoing final testing. It won’t be as polarizing as the original A2, nor will it fully embrace the new design language previewed by the Concept C. The small electric hatchback was penned while Marc Lichte was still overseeing Audi’s design team, before Massimo Frascella was appointed Head of Design in 2024. It remains to be seen whether Frascella has left his mark on the A2, but logic suggests the car’s design had already been frozen by the time he arrived in Ingolstadt. Whatever the case, Audi’s cheapest electric vehicle will feature split headlights. Elsewhere, traditional door handles are absent, replaced by tiny winglets integrated into the beltline for a layout also seen on the Ford Mustang Mach-E. The newcomer will predictably slot below the Q4 E-Tron and is likely to carry the same suffix as Audi’s other EVs. The A2 E-Tron will be closely related to the Volkswagen ID.3, possibly the updated version due soon. Interestingly, Autocar notes that Audi aims to lure buyers who miss the BMW i3 hatchback, which was retired in 2022. Coincidentally, Munich is also reviving the i3 name, though it’s being repurposed for an electric sedan in the 3 Series segment. Given Audi’s premium positioning, the A2 is expected to command a price premium over its mainstream ID.3 sibling. VW charges €33,330 for the base version in Germany, so it’s reasonable to assume the tuxedo-wearing cousin will cost north of €35,000. Motor1's Take: The new A2 will be an intriguing addition to an electric luxury segment dominated by far larger and more expensive vehicles. Its styling likely won’t be to everyone’s taste, but we appreciate Audi for injecting some of the original model’s funkiness into its indirect successor. We wouldn’t count on seeing the A2 E-Tron in the United States, given its small footprint. After all, VW doesn’t sell the ID.3 in North America either. In Europe, however, it stands a better chance of success than the original A2, helped by the steadily growing appetite for EVs. In 2025, purely electric cars accounted for 19.5 percent of all vehicles sold across the 27 EU countries, plus the UK, Iceland, Liechtenstein, Norway, and Switzerland. Audi's New Product Assault: \n                                    Source:\n                                    \n                                                                            Autocar  \n\n\n\nWe want your opinion!\n What would you like to see on Motor1.com? - The Motor1.com Team Popular latest articles RECOMMENDED FOR YOU Audi Admits It Shouldn't Have Changed Its Naming Strategy Nissan Dealer Hypes 'Radical-Looking' New Xterra Every Audi Will Get The New Grille   'Altima-Level Driving’: Woman Takes Escalade For A Spin. Then She Makes Wrong Turn–And Everyone Tells Her To Get A Camry Instead Audi CEO: A Truck Is The Last Thing We'd Build Volkswagen Injects GTI Hot Hatch Attitude Into A Van Audi Confirms RS5 Plug-In Hybrid Is Coming This Year",
        "ingested_at": "2026-02-05T16:44:04.778641"
    },
    {
        "source_url": "https://www.motor1.com/rss/news/all/",
        "category_group": "Auto",
        "title": "Dead: Kia Niro PHEV",
        "link": "https://www.motor1.com/news/786421/kia-niro-phev-dead/",
        "published": "Wed, 04 Feb 2026 22:00:34 +0000",
        "summary_rss": "Kia is killing off its forgotten Niro plug-in hybrid for the 2026 model year.",
        "full_text": "Another one bites the dust. With nine vehicles already slated to disappear by 2027, Kia is adding one more to the list. The Niro PHEV is dead for 2026. The company confirmed the news in a statement to Kelley Blue Book, saying, \"Due to changing market conditions, the 2026 Niro PHEV will no longer be available in the US market.\" 2023 Kia Niro PHEV  This move shouldn’t come as much of a surprise. The plug-in hybrid was always the odd one out in the Niro lineup, playing third fiddle to both the standard gas model and the fully electric version. Kia sold just 31,182 Niro models in total last year, with the PHEV likely accounting for the smallest slice of that figure (the company doesn’t break down sales by powertrain). The good news—for now—is that the gas-powered Niro and the Niro EV are expected to stick around through 2027. Motor1's Take: This isn’t the first plug-in hybrid to meet its maker in 2027, and it likely won’t be the last. With fewer buyers seemingly interested in plug-in hybrids in the US, companies are killing off the slow-selling models seemingly by the dozen. The Latest From Kia \n                                    Source:\n                                    \n                                                                            Kelley Blue Book  \n\n\n\nWe want your opinion!\n What would you like to see on Motor1.com? - The Motor1.com Team Popular latest articles RECOMMENDED FOR YOU 2023 Kia Niro PHEV Starts $35,035, Offers 33-Mile Electric Range Nissan Dealer Hypes 'Radical-Looking' New Xterra 2022 Kia Niro Plus Revealed For Taxi Operators And Ride-Hailing 'Altima-Level Driving’: Woman Takes Escalade For A Spin. Then She Makes Wrong Turn–And Everyone Tells Her To Get A Camry Instead 2022 Kia Niro PHEV And EV Technical Specifications Released Volkswagen Injects GTI Hot Hatch Attitude Into A Van 2018 Kia Niro PHEV Review: Electrified Simplicity",
        "ingested_at": "2026-02-05T16:44:07.112567"
    },
    {
        "source_url": "https://www.motor1.com/rss/news/all/",
        "category_group": "Auto",
        "title": "Bugatti Took Its Best Hypercars Ice Drifting. It's Pure Cinema",
        "link": "https://www.motor1.com/news/786401/bugatti-drifting-on-ice/",
        "published": "Wed, 04 Feb 2026 19:00:00 +0000",
        "summary_rss": "Bugatti brought out some of its classics and current models to let them drift on the ICE in St. Moritz.",
        "full_text": "The cold can't stop a Bugatti owner from enjoying their amazing machine. The annual ICE at St. Moritz proves to be the perfect playground for these hypercars, as evidenced by the video below.  Bugatti brought out a handful of machines that celebrate its lineage, both classic and current. From a scaled-down Type 35 and what looks to be a gorgeous Type 51, on up to a trio of ballistic Bolide hyper-exotics, the range of cars looked resplendent on the ice and snow-covered course.  Anytime you find this many Bugatti models in one place, it's safe to assume this is a special occasion. I think what's most impressive, however, is the amount of traction the drivers found in these conditions. Yes, the Veyrons and Bolides have all-wheel drive. But that's a whole lot of power being put down to a rather slippery and cold surface. I'm curious whether someone makes snow tires for these cars. And, if so, I'm also quite curious what a set of those would run. Which car was the coolest car out there (no pun intended)? My vote goes for the person driving the EB110. While it's down on power compared to the wicked machines around it, that car is quite indicative of its era and remains a major milestone on the timeline of all things supercar. The actual coolest people out there are the people in the vintage open wheelers, of course. Motor1's Take: Watching high-dollar, high-horsepower machinery drifting across a snowy landscape is a sight to behold. We applaud any such super and hypercar owners willing to fully enjoy the capabilities of their cars. More Bugatti News \n                                    Source:\n                                    \n                                                                            Bugatti  \n\n\n\nWe want your opinion!\n What would you like to see on Motor1.com? - The Motor1.com Team Popular latest articles RECOMMENDED FOR YOU Bugatti Almost Made An Even More Powerful Veyron Nissan Dealer Hypes 'Radical-Looking' New Xterra Bugatti's Latest One-Off Is A 1,578-HP Tribute To The Veyron 'Altima-Level Driving’: Woman Takes Escalade For A Spin. Then She Makes Wrong Turn–And Everyone Tells Her To Get A Camry Instead VW Secretly Stuffed A W16 Engine In A Lamborghini Diablo Volkswagen Injects GTI Hot Hatch Attitude Into A Van Bugatti Veyron Test Driver Describes Braking From 249 MPH: 'Incredibly Stressful'",
        "ingested_at": "2026-02-05T16:44:09.162201"
    }
]